const byAuthor = {
    rabbiYaKov: ["רבי יעקב אביחצירא",
        {
            text: "יָהּ מָרַנָא דְּבַשְּׁמַיָּא, לְךָ עֵינָא זְקִיפָא תַּלְיָא\nשֶׁיָּזִיב לְנֹא מִבֵּין עַמְמַיָּא, בְּדִיל שִׁמְךָ מַלְכָּא דִּקְשׁוֹטָא\nמָרִי קְטִירִי אֲזִקֵּי שָׂרִי. שָׂרִי שֶׁדַּר רָוּפִּינוּס דִּדָּן\nאַמַּאי אַכַּתִּי מַטְרוּנָא דּוֹרְמִיטָא עִדָּן עִדָּנִין וּפֶלֶג מֶטָא,\n\nעָבַד עִמַּנָא אֶת לַטָּבָא, יָאוֹת לְךָ אֶת מַלְכָּא רַבָּא\nלִשְׁבֹּק חֶטְאָהּ רַבָּא וְחֻבָּא, יָדְךָ רַבְרְבָא וּשְׁלִיטָא\n\nקְרֵבִין דִּדְּךָ אֲנַן מַלְכָּא, אִכְדִּין הַשַּׁתָּא הוֹי אִיפְּכָא\nשִׂנְאָה אָמַר פֻּרְקָן לֵיכָּא, שָׁקִיל מִינָן אוֹף מַרְטוּטָא\n\nבְּדִיל שְׁכִינָתְךָ מָרָן סַכֵּי, דֶּהָיֵא יַתְּבָא בְּגוֹ חֲשׂוּכֵי\nוְשָׁנְאָהָא מַלְכֵי וְאִפַּרְכִי, אִכְדִּין אִתְהֲפַכְתְּ שִׁטָּה\n\nחַוְיָא דִּכְמִין עָלַי אַרְחָא, גֵּרִי בָּהּ יָת מַלְכָּא מְשִׁיחָא\nיִמְחִי יְתָה עָלַי מָחָא, וְעַל כָּל עִמָּהּ אִתַּי לוּטָא\n\nזְכוּן אִי לֵית בְּיָדָן הַשַּׁתָּא, אָה זְכוּתָא דְּאַבַּהִּתָּא\nוּדְכָר קַבְּלָא דְּאוֹרָיְתָא, וְתוּ אִית סַגִּי מִלָּטָא דַּפְשִׁיטָא\n\nקְהָלָא קַדִּישָׁא הַדִּין, דְּאִינוּן כְּעַן עַבְּדִין לְעָבְדִין\nכְּנוּס לוֹן תָּו בְּלֹא פְּרוֹדִין, כֻּלֵּי עָלְמָא רַבָּא וְזוּטָא",
            name: "יה מרנא דבשמיא",
            double: true
        },
        {
            text: "צַהֲלִי רֹנִּי עֵדָה שְׁלֵמָה בְּיוֹם זֶה תּוֹרָה לַחֻפָּה נִכְנְסָה\nזֹאת הִיא כְּבֵדָה בַּת מֶלֶךְ פְּנִימָה וּמִמִּשְׁבְּצוֹת זָהָב לְבוּשָׁהּ\n\nאָשַׁרְנוּ מָה טוֹב נָעִים גּוֹרָלֵנוּ עַל תּוֹרַת אֱמֶת אֵל חַי נָתַן לָנוּ\nוְחַיֵּי עוֹלָם נָטַע בְּתוֹכֵנוּ זוֹ הִיא בְּרָכָה זוֹ הִיא קְדֻשָּׁה\n\nנוֹדַעַת לָנוּ חִבָּה יְתֵרָה אֲשֶׁר אֵין תִּכְלָה וְקֵץ לִשְׂעוֹרָה\nעַל כְּלִי חֶמְדָּה שֶׁבּוֹ עוֹלָם נִבְרָא נָתַן אֵל לָנוּ לָעַד מוֹרָשָׁה\n\nיִשְׂמַח יִשְׂרָאֵל בְּכִפְלֵי כִּפְלַיִם עַל כִּי לֶקַח טוֹב נָתַן לוֹ לְקַיֵּם\nהַמִּכְתָּב מִכְתַּב אֱלֹהִים חַיִּים אַשְׁרֵי הָעָם שֶׁכָּכָה חֹן מָצָא\n\nיָגֵל הַכּוֹתֵב אֶת סֵפֶר הַתּוֹרָה וְגַם הַקּוֹנֶה יוֹשֵׁב בְּזִמְרָה\nשְׁנֵיהֶם טוֹבִים צְדָקָה שְׁמוּרָה לִפְנֵי נֶאֱמָן אֵל רָם וְנִשָּׂא\n\nעַז תַּעֲצֻמוֹת קְדֻשַּׁת הַסֵּפֶר מִי יוּכַל הֶשֵּׂג מִי יוּכַל לְסַפֵּר\nאִמְרוֹת יְיָ הֵם אִמְרֵי שֶׁפֶר שָׂם רֶמֶז פָּשַׁט וְסוֹד וְדָרְשָׁה\n\nקְדֻשַּׁת תֵּבוֹת רְשׁוּמָה בִּסְפִירוֹת תֹּאַר צוּרָתָם אוֹרוֹת יְקָרוֹת\nהֵמָּה מְלָכִים וּבְרֹאשָׁם עֲטָרוֹת לָזֶה יֵשׁ כֶּתֶר וּלְזֶה שְׁלֹשָׁה\n\nבְּנוֹת צִיּוֹן צְאֶינָה וּרְאֶינָה מֶלֶךְ שְׁלֵמָה בְּיוֹם חֲתָנָהּ\nרָאוּ עֲטָרָה וְחֻפָּה נְכוֹנָה גִּלּוּ בִּרְעָדָה וְשִׂמְחָה וְדִיצָה\n\nחָתָן קְדֻשָּׁה יוֹם זֶה חֻפָּתוֹ בִּשְׂמָחוֹת וְגִיל יוֹבֵל לְטִירָתוֹ\nצָרִיךְ כָּל אָדָם לָצֵאת לִקְרָאתוֹ מִנַּעַר וְעַד זָקֵן מֵאִישׁ וְעַד אִשָּׁה\n\nזֶה הַיּוֹם נָגִיל וְגַם נִשְׂמְחָה בּוֹ הַמֶּלֶךְ יוֹשֵׁב בְּתוֹךְ מְסִבּוֹ\nכָּל רַע אוֹהֵב וְקָרוֹב יָבוֹא אֶל תּוֹךְ הַמִּשְׁתֶּה אֲשֶׁר הַמֶּלֶךְ עָשָׂה\n\nקוֹלֵנוּ שָׁמַע שׁוֹמֵעַ תְּפִלּוֹת הָרָם קַרְנֵנוּ מִתּוֹךְ הַגָּלוּת\nבִּזְכוּת הַתּוֹרָה רַבַּת הַמַּעֲלוֹת אָז נָשִׁיר לְךָ שִׁירָה חֲדָשָׁה",
            name: "צהלי רני",
            double: true
        },
        {
            text: "אָשִׁיר לִכְבוֹד חֲבֵרִים, וּבְרֹאשָׁם מַלְכָּם אָרִים\nבַּר יוֹחַאי עוֹקֵר הָרִים וְדוֹרֵשׁ טוֹב לְעַמּוֹ\n\nנֶחְתַּם בְּכֶתֶר תּוֹרָה, כְּלוּלִים בּוֹ עֲשָׂרָה\nרְאוּ נָא בָּעֲטָרָה שֶׁעִטְּרָה לּוֹ אִמּוֹ\n\nכַּבִּיר בָּנוּ אַחֲרָיו, ר' אֶלְעָזָר אַשְׁרָיו\nנִכְנַס בָּא בַּחֲדָרָיו שֶׁל הַמֶּלֶךְ שְׁלֵמָה\n\nיקיר עִם זְכוּת אָבוֹת, הִשִּׂיג מַעֲלוֹת רַבּוֹת\nנִגְלוֹ לוֹ ל''ב נְתִיבוֹת בָּהֶם רַבִּים יֶחְכָּמוּ\n\nידיד בְּעָז הִתְאַזָּר, רַב רַבִּי אַבָּא חָזַר\nהוּא וְרַבִּי אֶלְעָזָר אֲחוּזִים בְּיָ''הּ שְׁמוֹ\n\nעֲלֵה לְעִיר גִּבּוֹרִים, בָּהּ חֲמִישִׁים שְׁעָרִים\nמִשָּׁם יוֹצְאִים נְהָרִים וַיִּתְהַלְּכוּ לְעַמּוֹ\n\nקַו חֶסֶד קְנֵה, רַבִּי יְהוּדָה חָנָה\nוְהָעוֹלָם בּוֹ בָּנָה עֹשֶׂה שָׁלוֹם בִּמְרוֹמוֹ\n\nבְּזֶה הוּא רֹאשׁ קְדוֹשָׁה, רַק לֹא בָּא אֵל שְׁלוֹשָׁה\nאַךְ נִכְבַּד מִן הַשִּׁשָּׁה הָיְתָה מִשְׂרָה עַל שֶׁכְּמוֹ\n\nאִישׁ גִּבּוֹר בְּסוֹד תּוֹרָה רַבִּי יִצְחָק הֶאָרָה מִדָּתוֹ\nהִיא גְּבוּרָה צַפִּיחִית מְדַבשׁ טַעֲמוֹ\n\nבְּפִיהוּ אֱמֶת נִכְתַּם רַבִּי יוֹסֵי בַּר יַעֲקֹב תָּם\nעֵץ הַחַיִּים בּוֹ נֶחְתַּם הִיא תִּפְאֶרֶת עֻזָּמוֹ\n\nיָשָׁר רַבֵּי חִזְקִיָּה בְּנֶצַח נַפְשׁוֹ חַיָּה גַּם הוֹד בּוֹ\nכָּלוּל נִהְיֶה הַמְשֵׁל וּפַחַד עַמּוֹ\n\nחָבְרוּ רַבִּי יִסָּא הוֹד וְהָדָר בּוֹ נִמְצָא מִדָּה טוֹבָה\nבָּהּ יִשָּׂא לְרֹאשׁ סַכְתְּ שְׁלוֹמוֹ\n\nצְבָאוֹת בָּהּ נִצְמָדִים שְׁנֵיהֶם יַחַד דּוֹדִים הֵם וּוַי\nהָעַמּוּדִים יָשָׁר יֶחֱזוּ פָּנֵימוֹ\n\nיְסוֹד בְּרַבִּי חַיָּא כָּאן נִמְצָא וְכָאן הָיָה מִשָּׁם\nיוֹצְאָהּ תּוּשִׁיָּה אִמְרוֹתָיו כִּי נָעֲמוּ\n\nרַבִּי יוֹסִי לוֹ זְכוּת הוּא זָכָה אֶל הַמַּלְכוּת כָּל\nתֵּשַׁע הֵם מַלְכוּת שֵׁם כְּבוֹד מִמְּקוֹמוֹ\n\nאַשְׁרֵהוּ לְבַר יוֹחַאי, שֶׁהוּא עַד עֵת בּוֹ מְשִׁיחִי\nקַיֵּם הוּא נֶפֶשׁ כָּל חַי הֵמָּה יֹאכְלוּ בְּלַחְמוֹ\n\nחִזְּקוֹ עֵדָה כְּלוֹלְלָה, הַרְבּוּ שִׂמְחָה וְגִילָה\nבְּיוֹם זֶה יוֹם הִלּוּלָא דּוֹדִים לְכוּ לָחֲמוּ",
            name: "אשיר לכבוד חברים",
            double: true
        },
        {
            text: "בַּר יוֹחָאי יְסוֹד עוֹלָם, בּוֹ בָּחַר מֶלֶךְ עוֹלָם, בִּזְכוּתוֹ עוֹמֵד עוֹלָם, עַד בֹּא בֶּן דָּוִד מֶּלֶךְ.\n\nאַשְׁרֵי חֶלְקוֹ וְאַשְׁרֵי כָּל חֲבֵרָיו, אַשְׁרֵי הוֹגֵי אֲמָרָיו, מַעֲדַנֵּי הַמֶּלֶךְ.\nבַּר יוֹחָאי יְסוֹד עוֹלָם, בּוֹ בָּחַר מֶלֶךְ עוֹלָם, בִּזְכוּתוֹ עוֹמֵד עוֹלָם, עַד בֹּא בֶּן דָּוִד מֶּלֶךְ.\n\nנִגְלָה לוֹ סוֹד הַנִטְמָן, אֲשֶׁר נִגְלָה לְהֵימָן, הוּא בְּבֵיתִי נֶאֱמָן, בְּכָל גִּנְזֵי הַמֶּלֶךְ.\n\nיוֹם לִמְעָרָה בָּרָח, מִשָּׁם הָאוֹר לוֹ זָרָח, הֵצִיץ צִיץ וְגַם פָּרָח, וְגִּדְּלוֹ הַמֶּלֶךְ.\n\nיָצַק מַיִם אַשְׁרֵיהוּ, עַל יְדֵי אֵלִיָּהוּ, כָּל סוֹד נִפְלָא הוֹרָהוּ, כִּי כֵן צִוָּה הַמֶּלֶךְ.\n\nעֲבוֹדָה זוֹ תְּפִלָּה, הִיא הָעֹלָה לְמָעְלָה, אֶת סוֹדוֹתֶיהָ גִלָּה, כִּי כֵן יִסַּד הַמֶּלֶךְ.\n\nקְדֻשַּׁת שַׁבָּת קֹדֶשׁ וְסוֹד מוֹעֵד וָחֹדֶשׁ, גִּלָּה וְגַם סוֹד קַדִּישׁ, בְּרָב עָם הַדְרַת מֶלֶךְ.\n\nבְּרָכוֹת בְּסוֹד נִפְלָא, גִּלָּה אוֹתָם וְהִפְלָא, הַכֹּל לְעַטֵּר כַּלָּה, אֶל בֵּית הַמֶּלֶךְ.\n\nאוֹת בְּרִית צִיצִת וְאוֹת, תְּפִלִּין הַנּוֹרָאוֹת, הִוָּה בָּהֶם נִפְלָאוֹת, חֵן בְּעֵינֵי הַמֶּלֶךְ.\n\nבְּסוֹד הַסּוֹפֵר חָתַם, אוֹת בְּרִית טָמוּן נִסְתָּם, הַכֹּל בַּזֹּהַר נֶחְתַּם, בְּטַבַּעַת הַמֶּלֶךְ.\n\nיַחַד כָּל מִצְוֹת תּוֹרָה, גִּלָּה סוֹדָם וְהוֹרָה, הַכֹּל נֶחְתַּם בִּבְרִירָה, בְּחוֹתָם הַמֶּלֶךְ.\n\nחִבַּר כָּל הָעוֹלָמוֹת, וְיִחֵד כָּל הַשֵּׁמוֹת, וְתִקֵּן הַנְּשָׁמוֹת, לָבוֹא אֶל בֵּית הַמֶּלֶךְ.\n\nצֶדֶק וְשָׁלוֹם נָשָׁקוּ, חֶסֶד וֶאֱמֶת דָּבְקוּ עַל יָדוֹ נִתְמַתָּקוּ, וְנָחָה חֲמַת הַמֶּלֶך.\n\nיִחֵד אֶת הַשְּׁכִינָה, קִשְּׁטָהּ וֶהֶכִינָהּ, כָּל מַעֲשָׂיו אֱמוּנָה, טוֹב בְּעֵינֵי הַמֶּלֶךְ.\n\nרְאוּ יוֹם פְּטִירָתוֹ, הוּא נִקְרָא חֲתֻנָּתוֹ, בּוֹ נִכְנַס לְחֻפָּתוֹ, גִּנַּת בִּיתַן הַמֶּלֶךְ.\n\nאֶת קוֹל שִׂמְחָה וְרִנָּה, נִשְׁמַע בִּשְׁמֵי מְעֹנָה, צְאֶינָה גַם רְאֶינָה בְּנוֹת צִיּוֹן הַמֶּלֶךְ.\n\nחֶדְוָה וְשִׂמְחָה רַבָּה, שַׁעֲשׁוּעַ וְאַהֲבָה, עֵת בֹּא לָעוֹלָם הַבָּא, אֶל תּוֹךְ חֲצַר הַמֶּלֶךְ.\n\nזֶה הַיּוֹם לַ\"ג לָעֹמֶר, נְהַלֵּל בּוֹ נְזַמֵּר, עַל קָדוֹשׁ זֶה יֵאָמֵר, שִׁירוּ שִׁיר אֶל הַמֶּלֶךְ.\n\nקוֹלִי יֶעֱרַב לְךָ כְּמוֹ שַׁי לְפָנֶיךָ, קַדֵּשׁ בִּנְךָ בְּכֹרֶךָ, מַהֵר לְמִקְדַּשׁ הַמֶּלֶךְ.\nבַּר יוֹחָאי יְסוֹד עוֹלָם, בּוֹ בָּחַר מֶלֶךְ עוֹלָם, בִּזְכוּתוֹ עוֹמֵד עוֹלָם, עַד בֹּא בֶּן דָּוִד מֶּלֶךְ.",
            name: "בר יוחאי יסוד עולם",
            double: true
        },
        {
            text: "",
            name: "יבוא משיחנו בקרוב",
            double: true
        },
        {
            text: "",
            name: "שמעו בנים מוסר אב",
            double: true
        },
        {
            text: "אֵלִי אַנְוֵהוּ וַאֲרֹמְמֶנְהוּ , בְּיוֹם מְנוּחָה הוּא שַׁבָּת לַיְּיָ:\n\nנְעִימָה בְּחִבַּת, קְרוּיָה רַבַּת, וּשְׁמַרְתֶּם הַשׁ ׁבַּת, קֹדֶשׁ לַיְּיָ:\n\nיוֹדֵעַ סוֹדָהּ , נִזְהָר בִּכְבוֹדָהּ, אֲשֶׁר לוֹ יְעָדָהּ, כִּדְבַר יְיָ:\n\nיָבִין מַעֲלָתָהּ, כִּי הַשּׁוֹמֵר אוֹתָהּ, כְּמוֹ הִלְּכַתָּה, מֵהַר יְיָ:\n\nעָוֹן גִּלּוּלוֹ, וְחֵטְא פָּעֳלוֹ , שָׁרוּי לוֹ מָחוֹל לוֹ, וְכִפֵּר יְיָ:\n\nָ קְרָא וּדְרֹשׁ, מִלַּת שַׁבָּת פְּרֹשׁ, קַח לְךָ שִׁי''ן רֹאשׁ, הַבֵּן עֹז יְיָ:\n\nבָּהּ חֶשְׁבּוֹן כָּפַר, כִּי הַשַּׁבָּת תֶּפֶר, חֵטְא רָשׁוּם בַּסֵּפֶר, לִפְנֵי יְיָ:\n\nבֵּי''ת תַּ''ו נִדְרֶשֶׁת, בַּת מֶלֶךְ מִתְפָּרֶשֶׁת, לָנוּ הִיא נִשֵּׂאת, מֵהַר יְיָ:\n\nנְחַשֵּׁב עוֹד מִלָּה, בְּשַׁבַּת מְעֻלָּה, מָלֵא אֶת כֻּלֹּה, דַּע נְאֻם יְיָ:\n\nאָז תִּמְצָא בַּדֹּק, חֶשְׁבּוֹן בְּדִקְדּוּק, שֻׁתָּף בַּת וְדוֹק, כֹּה אָמַר יְיָ :\n\nבֵּאֲרוּ חֲכָמֵינוּ, הַשּׁוֹמֵר שַׁבַּתֵּנוּ, שֻׁתָּף לֶאֱלֹהֵינוּ, גַּם חֲתַן יְיָ:\n\nיֵשׁ בְּשַׁבָּת שׁוּב, אוֹתִיּוֹת תֵּשֵׁב, כִּי בְּשַׁבָּת תַּחְשֹׁב, תְּשׁוּבָה לַיְּיָ:\n\nָ , חֵלֶף זֶה לְךָ אִם תִּבָּזֶה שַׁבָּת לְבֹשֶׁת נֶהְפְּכָה, וַיְנַגַּע יְיָ:\n\nצֹהַר פָּתוּחַ, שֶׁפַע מָתוּחַ, לְשׁוֹמְרֵי מָנוֹחַ, אֶת יוֹם יְיָ:\n\nיָחֵד בְּנִי הִזָּהֵר, לִכְבוֹד שַׁבָּת מַהֵר, וְאַל תְּהַרְהֵר, אַחֲרֵי יְיָ:\n\nָ , רֵאשִׁית דְּגָנֵךְ תִּירֹשְׁךָ וְיִצְהָרֵךְ מִבְחַר מַעֲדַנֶּיךָ תְּכַבֵּד יְיָ:\n\nָ אוֹר שֶׁמֶן כָּתִית, עַל שֶׁלְּחָנְךָ תַּת, הִתְעַנֵּג כִּי אָז תִּתְעַנַּג עַל יְיָ:\n\nָ  חִישׁ קְרָא בַּתּוֹרָה, בְּיוֹם זֶה בְּטָהֳרָה, לְךָ תִּהְיֶה אוֹרָה, יְבָרֶכְךָ יְיָ:\n\nזֶבֶד טוֹב יִזְבְּדֵךְ,  הַשֵּׁם יִשְׁמְרֵךְ, וְיָאֵר אֵלֶיךָ פָּנָיו יְיָ:\n\nקָיָם חַי לָעַד, מַהֵר לָנוּ סַעַד, רַגְלֵנוּ בַּל תִּמְעַד, מִיִּרְאַת יְיָ:",
            name: "אלי אנוהו",
            double: true
        }
    ],
    rabbiMasshud: ["רבי מסעוד אביחצירא",
        {
            text: "אֲרוֹמִמְךָ, אוֹדֶה שִׁמְךָ אֶל בַּעֲשׂוֹתְךָ נוֹרָאוֹת צַדִּיקֶיךָ, חֲסִידֶיךָ עוֹשֶׂה עַל יָדָם נִפְלָאוֹת בְּרוּאֶיךָ, יִירָאוּךָ לָהֶם לְמַזְכֶּרֶת וּלְאוֹת רַבִּי שִׁמְעוֹן גִּלָּה אוֹרָה רַבִּי מֵאִיר אוֹר מְנוֹרָה רַבִּי יַעֲקֹב אַבִּיחֲצִירָא קֹדֶשׁ הִלּוּלִים לָהּ'\n\nנִטְעֵי קֹדֶשׁ, הֵן נָטַעְתָּ וְקוֹל הַתּוֹר עֵת הַזָּמִיר ח''י לַחֹדֶשׁ, יוֹם טוֹב שַׂמְתָּ יוֹם הִלּוּלָה לָ''ג בָּעֹמֶר לְבַר יוֹחַאי, הוֹד עִטַּרְתָּ יוֹם לְיוֹם יַבִּיעַ אֹמֶר אַשְׁרֵי הָעָם שֶׁכָּכָה לּוֹ בִּמְקוֹם קַדְּשׁוֹ יְהַלְּלוֹ שָׁם יָלִינוּ, יִתְפַּלְּלוּ וְיֹאמְרוּ יִגְדַּל יְיָ\n\nיָבוֹאוּ שָׁם, עַם יִשְׂרָאֵל, מִכָּל מְדִינָה וּמְדִינָה גָּלִיל עֶלְיוֹן בִּיאַת גּוֹאֵל, שַׁמָּה גִּלּוּי הַשְּׁכִינָה נִשְׁמַת צַדִּיק מֵאֵל שׁוֹאֵל, לְקָרֵב עֵת לְחַנְּנָהּ בִּזְכוּת שִׂמְחַת זוֹ תּוֹרָתוֹ, הַלּוֹמְדִים קְהַל עֲדָתוֹ וּמְגַלִּים רָזֵי תּוֹרָתוֹ, קָדוֹשׁ כְּמַלְאָךְ יְיָ\n\nמֶלֶךְ תָּמִים הוּא הַתַּנָּא, ר' מֵאִיר בַּעַל הַנֵּס פֶּסַח שֵׁנִי, בּוֹ נִתְקָנָה, הִלּוּלָה לְמוֹפֵת וָנֵס זְכוּתוֹ הִיא מָגֵן צִנָּה, נִדְחֵי יִשְׂרָאֵל יְכַנֵּס נָא יְיָ הוֹשִׁיעָה נָא יְיָ הַצְלִיחָה נָא נָא יְיָ הַרְוִיחָהּ, נָא חִישׁ וְיוֹשַׁע יְיָ\n\nסַגְ'לַמַּסָּא עִיר תְּמָרִים פָּרַח בָּהּ צַדִּיק כַּתָּמָר דֶּגֶל תּוֹרָה הֵקִים הֵרִים שָׁט בַּפַּרְדֵּס כְּמִין חֻמַּר הוֹצִיא לָאוֹר זִו סְתָרִים כָּל דָּבָר וְכָל מַאֲמָר יִרְאָה תַּמָּה הִלְבִּישַׁתּוּ וַעֲנָוָה עִטְּרָתוֹ בַּמְּדִינוֹת שְׁמוּעָתוֹ דַּעַת וְיִרְאַת יְיָ\n\nעָלָה לִשְׁכֹּן בְּאַרְצֵנוּ לִשְׁאֹב מֵימֵי הַטָּהֳרָה יָשִׁיב פִּקָּדוֹן יוֹצְרוֹ קוֹנוֹ בְּתוֹךְ אֶרֶץ הַטְּהוֹרָה חַי וְקַיָּם אֵל בִּרְצוֹנוֹ הִתְקִין מְקוֹם הַקְּבֻרָהּ בְּדַמַּנְהוּר הִיא אֶרֶץ גֹּשֶׁן עִיר שְׁבָטִים הַמְיֻחָסִים שָׁמָּה יֹשֵׁב שָׁמָּה יָשֵׁן בִּמְקוֹם בּוֹ בָּחַר יְיָ\n\nוְאִישׁ מֹשֶׁה בֶּן שֲׁרוֹשִׁי בָּנָה הֵיכָל וּבוֹ קֻבָּה וְגַם נָדַר לִהְיוֹת עֹשֵׂה הִלּוּלָה לִכְבוֹד שַׂר צָבָא בִּרְצוֹן הָאֵל צוּר קְדֹשִׁי גָּזַר אֹמֶר לִהְיוֹת חוֹבָה חֹדֶשׁ טֵבֵת בְּיוֹם עֶשְׂרִים בָּאִים סְבִיבוֹת הֶעָרִים וְעוֹשִׂים סְעֻדּוֹת יְקָרִים בְּחַצְרוֹת בֵּית יְיָ\n\nדּוֹדִים רֵעִים שְׁתוּ שִׁכְרוּ בְּהִלּוּלִים שְׁלֹשָׁה זֶה שמ''י לְעוֹלָם שִׁמְרוּ לְשָׁם הָאֵל רָם וְנִשָּׂא אָז יִקְרַב קֵץ גְּאֻלָּה לִהְיוֹת לוֹ לְעַם סְגֻלָּה וְלִהְיוֹת לוֹ לְנַחֲלָה בְּתוֹךְ מְקַדֵּשׁ יְיָ",
            name: "ארוממיך אודה שמך",
            double: true
        },
        {
            text: "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת אֶעֱנֶה חֶלְקִי גַּם אֲנִי\nלְעוֹרֵר לִבִּי אַהֲבַת צוּר עֲשָׁנִי וַיְכוֹנֲנִי\nוּלְעַבְדּוֹ תָּמִיד בְּחִבַּת רֹב חַסְדּוֹ אֲשֶׁר זִכַּנִי\nלְהַלֵּל בְּפִי וּלְשׁוֹנִי\nסוֹד שַׁבָּת זָכוֹר וְשָׁמוֹר אוֹת בְּרִית בֵּינוֹ וּבֵינִי\n\nסְגֻלַּת שַׁבָּת יְקָרָה מַשְׁפַּעַת בְּיָמִים שִׁשָּׁה\nשָׁלֹשׁ מִשַּׁבַּת שֶׁעָבְרָה וּמִן הַבָּאָה שְׁלֹשָׁה\nצָרִיךְ כָּל אָדָם זְכִירָה לְהַמְשִׁיךְ עָלָיו קְדֻשָּׁה\nכְּדַל כֶּעָשִׁיר כֶּעָנִי  : סוֹד\n\nעֶרֶב הַשַּׁבָּת יוֹם שִׁשִּׁי תִּקְנֶה כָּל צֹרֶךְ שַׁבַּתְּךָ\nתָּכִין בְּעַצְמְךָ תַּעֲשֶׂה וְלֹא עַל יְדֵי זוּלָתְךָ\nאֵל מֶלֶךְ יֹשֵׁב עַל כִּסֵּא אֹרֵחַ הַבָּא לִקְרָאתְךָ\nמָה תֹּאמַר וּמָה תַּעֲנֶה  : סוֹד\n\nוּלְקַדֵּשׁ נֹגַהּ חֵן תִּמְצָא פָּרָשַׁת שָׁבוּעַ תִּקְרָא\nשְׁנַיִם מִקְרָא בִּקְדֻשָּׁה וְאֶחָד תַּרְגּוּם בְּמוֹרָא\nטְבִילַת מִצְוָה לְרָחְצָה תִּטְבֹּל בְּמִקְוֵה טָהֳרָה\nאָז בִּצְדָקָה תְּכוֹנְנִי : סוֹד\n\nדִּין מַיִם חַמִּים תַּדִּיחַ פָּנִים יָדָיִם רַגְלַיִם\nסוֹד שַׁלְהֶבֶת יָהּ תָּשִׂיחַ פָּסוּק הַכָּתוּב לְחַיִּים\nאָז הַקְּלִפּוֹת תַּזְנִיחַ מִקֶּרֶב יְרוּשָׁלַיִם\n מַהֵר תְּכוֹנֵן וְתִבְנֶה  : סוֹד\n\nאַרְבַּע בְּגָדִים לְבָנִים, מִשְּׁנַת חֲסִידִים שְׁנוּיָהּ, \nלִכְבוֹד שַׁבָּת מְזֻמָּנִים, לְשָׁרֵת בִּכְסוּת נְקִיָּה, \nרֶמֶז לְאוֹרוֹת עֶלְיוֹנִים, אַרְבַּע אוֹתִיּוֹת הַוַּיָּ\"ה, \nבִּגְדֵי יֶשַׁע תַּלְבִּישֵׁנִי:  סוֹד\n\nבִּתְפִלַּת מִנְחָה בָּעֶרֶב, מַתְחִיל עִלּוּי הָעוֹלָמוֹת,\nאוֹתִיּוֹת הַשֵּׁם לְקָרֵב, אַחַת בְּאַחַת עִם שֵׁמוֹת, \nהַיּוֹצְאִים מֵהֶם בְּקֶרֶב, מַחְשְׁבוֹתֶיךָ יִהְיוּ נִרְשָׁמוֹת, \nנַפְשִׁי יְשׁוֹבֵב יַנְחֵנִי :  סוֹד\n\nיְצִיאַת שָׂדֶה לְהַקְבִּיל, אֶת פְּנֵי שַׁבָּת מַלְכְּתָא, \nנִיצוֹצוֹת קַיִן וָהֶבֶל, לַעֲלוֹת מִגּוֹ עֲמִיקְתָּא, \nיִמְצְאוּ נַחֲלַת חֵבֶל, נַפְשִׁי נִכְסְפָה גַּם כָּלְתָה,\n תְּשַׁוֵּעַ תֹּאמַר הִנֵּנִי:   סוֹד\n\nחוֹבָה שְׁנֵי נֵרוֹת תַּדְרִים, נֵר מִצְוָה אוֹרָה יְגַלֶּה,\nשְׁנֵי מְאוֹרוֹת מַזְהִירִים, אַדְנוּת פָּשׁוּט וְאֵל מָלֵא,\nשָׁלֹשׁ יִחוּדִים מְאִירִים, מִסְפָּרָם לְנֵר יַעֲלֶה,\n מִלְּוַי שַׁדַּ\"י שָׂם יַחֲנֶה:   סוֹד\n\nצִנּוֹרֵי שֶׁפַע בְּרָכָה, יָרִיקוּ בַּעֲנִית בָּרְכוּ,\nרוּחַ הַקֹּדֶשׁ נִמְשָׁכָה, עַל כָּל־אָדָם לְפִי עֶרְכּוֹ,\nעֶבֶד נֶאֱמָן עַל כָּכָה, הֻפְקַד בְּמַאֲמַר מַלְכּוֹ,\nרוּחַ נְדִיבָה תִּסְמְכֵנִי:   סוֹד\n\nיִתְּפַלֵּל עַרְבִית בְּאֵימָה, בְּקוֹל גָּדוֹל בְּסוֹד נֹעַם,\nבִּרְכוֹת שְׁמַע בִּנְעִימָה, בְּכַוָּנָה וּבְטוּב טַעַם,\nוּפְרֹשׂ תּוֹסֶפֶת נְשָׁמָה, תְּכַוֵּן בְּתוֹךְ קְהַל עַם,\nנִשְׁמַת שַׁדַּי תְּבִינֵנִי:    סוֹד\n\nרוֹמְמוֹת אֵל רָם וְנִשָּׂא, בִּמְקוֹם כְּבוֹדוֹ הַלַּיְלָה,\nלְפָנָיו נָאוָה כְּתִרְצָה, מַלְכוּתוֹ בַּכֹּל מָשָׁלָה,\nעָלְתָה לְמַעְלָה וְלָבְשָׁה, כָּל־כָּ\"ד קִשּׁוּטֵי הַכַּלָּה,\nאֶל חֲדָרָיו הֱבִיאַנִי:     סוֹד\n\nאָז תֹּאמַר עֵדוּת קִדּוּשִׁין, בְּשָׁלֹשׁ וַיְּכֻלּוֹ נוֹסָדָה,\nרִאשׁוֹנָה חֲקַל נֶגֶד שִׁי\"ן, תַּפּוּחִין אַחַר עֲמִידָה,\nחֲקַל תַּפּוּחִין קַדִּישִׁין, נִקְרֵאת בְּקִדּוּשׁ סְעוּדָה,\nלֶחֶם חֻקִּי הַטְרִיפֵנִי:\nסוֹד שַׁבָּת זָכוֹר וְשָׁמוֹר, אוֹת בְּרִית בֵּינוֹוּבֵינִי\n",
            name: "מזמור שיר ליום השבת",
            double: true
        },
        {
            text: "יוֹם הַשַׁבָּת טוֹב לְהֹדוֹת לָאֵל נוֹרָא תְהִלּוֹת\nלַמְנַצֵּחַ שִׁיר יְדִידֹת זֶמֶר שִׁיר לַמַּעֲלוֹת\n\nאַחַת מִדַּבְּרֹתֶיךָ זָכוֹר וְשָׁמוֹר בְּתוֹרָתֶךָ\nלְהַגִּיד בַּבֹּקֶר חַסְדֶּךָ אֱמוּנָתְךָ בַּלֵּילוֹת\n\nנֹעַם ה' לַחֲזוֹת בְּעוֹד לַיִל בִּזְרִיזוּת\nלִשְׁמֹר פְּתָחִים וּמְזוּזֹת לְהַלֵּל בְּתוֹךְ מַקְהֵלוֹת\n\nיָשָׁר יֶחֱזוּ פָנֶיךָ חוּט חֶסֶד מָשׁוּךְ עָלֶיךָ\nלַעֲמֹד עַל מִשְׁמַרְתֶּךָ לְכוּ חֲזוּ מִפְעֲלוֹת\n\nמִנִּשְׁמַת תִּזְרַח נַפְשֶׁךָ סְמֹךְ גְּאֻלָּה רוּחֶךָ\nאַיֵּה מְקוֹם נִשְׁמָתֶךָ בָּרוּךְ עֹשֶׂה גְדֹלוֹת\n\nסוֹד זֶה בְלִבְּךָ הַצְפִּינוֹ מַחְשְׁבוֹתֶיךָ יִכֹּנוּ\nאָז יִשְׂמַח מֹשֶׁה רַבֵּנוּ בְּאַהֲבַת כְּלוּלוֹת\n\nעֹנֶג לַשַׁבָּת אָז תִּקְרָא לִכְבוֹד נֶפֶשׁ יְתֵרָה\nגַּם לְהִתְעַנֵּג בַּתּוֹרָה בָּרוּךְ עוֹשֶׂה גְדֹלוֹת\n\nוּבְקִדּוּשָׁא רַבָּא וְשָׁמְרוּ שְׂמֹאל עִם יָמִין נִקְשָׁרוּ\nפָּנִים בְּפָנִים נָהָרוּ קוֹל חֲתָנִים בְּמִצְהָלוֹת\n\nדָּא סְעֻדְתָּא דְעַתִּיקָא קַדִּישָׁא חֶסֶד מְרִיקָה\nמֵחֶבֶל גּוֹג וַעֲלוּקָה שָׁלֹשׁ סְעֻדּוֹת מַצִּילוֹת\n\nאָז תִּתְעַנַּג עַל ה' מָקוֹם גָּבֹהַּ מִלְּפָנַי\nכַּאֲשֶׁר הוֹרוּ נְבוֹנַי טְמוּנוֹת לָהֶם נִגְלוֹת\n\nבְּכָבוֹד תֵּשֵׁב בְּשִׂמְחָה נָסוּ יָגוֹן וַאֲנָחָה\nיוֹם תַּעֲנוּג יוֹם מְנוּחָה קוֹל חֲתָנִים וְקוֹל כַּלּוֹת\n\nיְצַו ה' אִתְּךָ הַבְּרָכָה בַּאֲסָמֶיךָ\nכִּי כָל מוֹצָא שַׁבָּתְךָ בְּהוֹצָאוֹת כְּפוּלוֹת\n\nחֶשְׁבּוֹן שַׁבָּת בְּמִנְיָנָהּ רֵי''ש בִּמְקוֹם בֵּי''ת נְתוּנָה\nת''ר כֶּפֶל אוֹת שי''ן רִאשׁוֹנָה לְהוֹרוֹת הַכְּפִילוּת\n\nצַדִּיק אֹכֵל לִכְבוֹד נַפְשׁוֹ אֵיבָרָיו יִתְקַדְּשׁוּ\nצֶלֶם אֱלֹהִים עַל רֹאשׁוֹ אֲיֻמָּה כַּנִּגְדָּלוֹת\n\nיְבָרֵךְ בִּרְכַּת מְזוֹנוֹ רוּחוֹ וְנִשְׁמָתוֹ יֵהָנוּ\nמֵאוֹר הַבָּהִיר יִזּוֹנוּ עֵינֵי הַשֶּׂכֶל מִסְתַּכְּלוֹת\n\nרְאֵה הִתְבּוֹנֵן אִם תִּשְׁמוֹר הַשַּבָּת כַּדִּין הַגָּמוּר\nיִגְאַל רֹכֵב עַל הַחֲמוֹר אֲסִירִים בִּכְבָלוֹת\n\nאַשְׁרֵי הַמְחַכֶּה בִימֵי חוֹל לִקְדֻשַּׁת שַׁבָּת שֶׁתָּחוּל\nכָּל עָוֹן כָּל פֶּשַׁע לוֹ מָחוּל יְשַׁבֵּר עֹל הַגָּלוּת\n\nחוֹמֵד זִיו קְדֻשַּׁת שַׁבָּת וּמְקַיֵם שְׁמִירַת שַׁבָּת\nיִזְכֶּה לְעוֹלָם כֻּלוֹ שַׁבָּת מַעֲלוֹת אַחַר מַעֲלוֹת",
            name: "יום השבת טוב להודות",
            double: true
        },
        {
            text: "",
            name: "לישראל עם סגולה",
            double: true
        }
    ],
    rabbiYitzhak: ["רבי יצחק אביחצירא",
        {
            text: "אָעוּפָה אֶשְׁכֹּנָה וְאַרְחִיקָה נְדֹד\nבַּמִּדְבָּר אָלִינָה וְאוּלַי אֶמְצָא דּוֹד\n\nנֶשֶׁק אַהֲבָתוֹ בְּלִבִּי בֹּעֵרָה\nמִיּוֹם פְּרֵדָתוֹ נַפְשִׁי עָלַי מָרָה\n\nיְדִיד מֶנִי בָּרַח הָלַךְ עֲזָבַנִי\nאֵיזוֹ דֶּרֶךְ אָרַח וְאֵלְכָה גַם אֲנִי\n\nיָצָאתִי לְבַקֵּשׁ דּוֹדִי בֵּין חֲבֵרִים\nנִלְכַּדְתִּי בְּמוֹקֵשׁ הִכּוּנִי הַשֹּׁמְרִים\n\nצִפִּיתִי לְדוֹדִי מָתַי יָבוֹא אֵלַי\nיַלְבִּישֵׁנִי עֶדְיִי וִירַחֵם עָלַי\n\nחֲשׁוֹף זְרוֹעֲךָ לְקַבֵּץ פְּזוּרִים\nגַּלֵּה קֵץ יִשְׁעֲךָ וְדִגְלְךָ הָרֵם\n\nקוּמִי יְחִידָתִי וְשׁוּבִי בִּתְשׁוּבָה\nאֲחוֹתִי רַעְיָתִי הִנֵּה גוֹאֲלֵךְ בָּא\n\nחֲמוּדָה יְקָרָה רַבַּת הַמַּעֲלוֹת\nגַּם מִפָּז נִבְחָרָה צְאִי נָא בִמְחוֹלוֹת\n\nזָכַרְתִּי לָךְ חֶסֶד נְעוּרַיִךְ נְעוּרִים\nהֵיכָלֵךְ אֲיַסֵּד בְּאַבְנֵי סַפִּירִים\n\nקוֹל דּוֹדִי הִנֵּה בָּא מְדַלֵּג עַל הֶהָרִים\nקוּמִי לָךְ אֲהוּבָה כִּי בָּא קֵץ דְּרוֹרִים",
            name: "אעופה אשכונה",
            double: true
        },
        {
            text: "יוֹנָתִי תַּמָּתִי יְקָרָה מִפְּנִינִים אֲחוֹתִי רַעְיָתִי הַצִּיבִי לְךָ צִיּוּנִים קוּמִי לְךָ יָפָתִי כִּי חָלְפוּ הַזְּמַנִּים בּוֹאִי לְךָ אֵימָה אַל תָּןַךְ יְרוּשָׁלַיִם:\n\nצַהֲלִי וְרוֹנִי. סֹעֲרָה לֹא נֻחָמָה. הִנְנִי שָׂב לִמְכוֹנִי. אֶגְאָלֵךְ בְּיָד רָמָה. אוֹשִׁיבֵךְ לִימִינִי לֹא תִּהְיֶה עוֹד שׁוֹמֵמָה. יָפָתִי נְעִימָה. הַבַּת יְרוּשָׁלַיִם:\n\nחֲשַׁקְתִּיךְ וְאַהַב מִקֶּדֶם מֵאוֹר כַּשְׂדִּים פָּדִיתִיךְ מִלַּהַב וְגַם מִבֵּית עֲבָדִים מָחַצְתִּי רֹאשׁ רַהַב וְגָאַלְתִּי יְדִידִים בְּשִׁירָה נְעִימָה בָּאוּ לִירוּשָׁלַיִם:\n\nקְרָאתִיךָ סְגֻלָּה חֶלְקִי וְנַחֲלָתִי כַּלָּה כָּל כְּלוּלָה נָתַתִּי לְךָ תּוֹרָתִי לְשֵׁם וְלִתְהִלָּה שֵׁם עוֹלָם לְךָ נָתַתִּי וְאֶבְנֶה חִיל וְחוֹמָה חוֹמוֹת יְרוּשָׁלַיִם:",
            name: "יונתי תמתי",
            double: true
        },
        {
            text: "",
            name: "כנפי יונה",
            double: true
        },
        {
            text: "",
            name: "אל אלוקים... רחום חנון",
            double: true
        },
        {
            text: "",
            name: "אשורר לך שיר",
            double: true
        },
        {
            text: "",
            name: "יום השביעי",
            double: true
        }
    ],
    rabbiDavid: ["רבי דוד אביחצירא",
        {
            text: "",
            name: "ה' אלוקינו",
            double: true
        },
        {
            text: "",
            name: "אמת קנה אל תמכור",
            double: true
        },
        {
            text: "",
            name: "אשירה לכבוד שבת",
            double: true
        }
    ],
    rabbiIsrael: ["רבי ישראל אביחצירא",
        {
            text: "יוֹדוּ לְךָ רַעְיוֹנַי אֵל מִבֶּטֶן יוֹצְרִי\nעַל קִרְבָתְךָ בְּסִינַי לְהָאִיר אֶת נֵרִי\nעַל כֵּן בְּתַחֲנוּנַי אֲפָאֵר בְּשִׁירִי\nבְּכָל יָמַי וְשָׁנַי עַד לָעַד לְעוֹלָם\n\nאֶשְׂמַח בְּךָ אֵל עוֹלָם\nאֶשְׂמַח בְּךָ גּוֹאֵל נַפְשִׁי\nאֶת גְּאֻלַּת עוֹלָם\n\nשְׂשׂוֹן לִבִּי הֵמָּה בְּזָכְרִי חֲסָדָיו\nכִּי בָחַר מִכָּל אֻמָּה יִשְׂרָאֵל עֲבָדָיו\nנֵצֶר נְטִיעָה תַמָּה הָאָבוֹת יְדִידָיו\nאֶבֶן צֶדֶק שְׁלֵמָה מִשֹׁרֶשׁ גִּדְּלָם\n\nרְצוֹנְךָ אֶשְׁאֲלָה חַי בַּעַל הָרָצוֹן\nכַּאֲשֶׁר בַּתְּחִלָּה נָהַגְתָּ אֶת הַצֹּאן\nבְּמִרְעֶה טוֹב וְנִפְלָא וְהָיָה כָל עֶלְצוֹן\nרוֹעֵה יִשְׂרָאֵל סֶלָה הַאֲזֵן אֶת קוֹלָם\n\nאַתָּה הוּא הָאֱלֹהִים הָעֵד וְהַדַּיָּן\nקוּם נָא לִקְרַאת גְּבָהִים צְאִי נָא מְזֻיָּן\nלִנְקֹם נִקְמָתְךָ מֵהֶם לְהַשְׁלִים כָּל עִנְיָן\nשִׁמְךָ וְכִסְאֲךָ שֶׁהֵם מֵעֵין כָּל חַי נֶעְלָם\n\nלְעֹשֵׂה נִפְלָאוֹת לְבַדּוֹ אֶת יְרִיבַי יָרִיב\nאֲקַוֶּה תָמִיד חַסְדּוֹ הַשְׁכֵּם וְהַעֲרֵב\nוְלֹא יָסֵךְ בַּעֲדוֹ אֶת טִירָתוֹ יַחֲרִיב\nוְאָז נָשִׁיר לִכְבוֹדוֹ הַשִּׁירִים בְּמָשְׁלָם\n\nחַזֵּק צִיּוֹן מוֹעֲדֵנוּ אֲשֶׁר מְכֻוֶּנֶת\nמוּל זְבוּל מִקְדָּשֵׁנוּ שֶׁהִיא הַנּוֹתֶנֶת\nכּ",
            name: "יודו לך רעיוני",
            double: true
        },
        {
            text: "אֶפְתַּח פִּי בְּדִינֵי שַׁבַּת קֹדֶשׁ גַּם בִּקְדֻשַּׁת נְשָׁמָה יְתֵרָה\n\nנָאֶה לָנוּ לְהַלֵּל לְקַדֵּשׁ הָעוֹטֵר יִשְׂרָאֵל בְּתִפְאָרָה\n\nיָהּ רָם יִתְרוֹמֵם בָּחַר וְקִדֵּשׁ עֲדָתוֹ מִכָּל אֻמָּה נִבְעֲרָה\n\nיוֹם הַשִּׁשִּׁי הַשְׁכֵּם לֵךְ לְשַׁמֵּשׁ צָרְכֵי שַׁבָּת חֶמְדָּה נִבְחֲרָה\n\nשִׂים נָא לִבְּךָ אַל תִּהְיֶה חוֹשֵׁשׁ חָלִילָה עַל כָּל כָּבוֹד וּשְׂרָרָה\n\nרָאָה בְּנִי בַּתַּלְמוּד וְחַפֵּשׂ מַאֲמָר קַדִּישִׁין שִׂים עֲטָרָה\n\nאָז תַּכִּיר מְעוּט עֶרְכְּךָ כִּי קְלִישׁ נֶגֶד רַבָּנָן נֶחֱשָׁב כְּעַפְרָא\n\nלִכְבוֹד עֹנֶג הַשַּׁבָּת לֹא תָחִיס עֵינְךָ עַל הַמָּמוֹן כִּי לֹא תִּירָא\n\nבְּנִי הַבֵּט בְּזֶה וְלֹא תַּרְגִּישׁ הַלֹּא בְּתִשְׁרֵי קִצְבָּה נֶעְדָּרָה\n\nלְכָל דִּינֵי הָעֵרוּב תְּחַפֵּשׂ כְּדֵי שֶׁתִּתְנַנְהֵג בָּם כַּשּׁוּרָה\n\nאֶת צִפָּרְנֶיךָ מַהֵר תְּקַצֵּץ עֶרֶב שַׁבָּת חוֹבָה נֶאֶמְרָה\n\nדַּע לְךָ וְהַבֵּן כִּי דִּינָם בָּאֵשׁ תְּלַהֵט רְשָׁעִים אֵשׁ בּוֹעֵרָה\n\nוְהִזָּהֵר בְּנֵי מְאֹד לְהַכְנִיס הַשַּׁבָּת עוֹד שֶׁמֶשׁ בִּגְבוּרָה\n\nנָכוֹן גַּם יָשָׁר לְךָ לְקַדֵּשׁ אֶת עַצְמְךָ בְּמִקְוֵה טַהֲרָה\n\nאָז תָּבִין אִם אַתָּה בַּעַל נֶפֶשׁ וְתַכִּיר בִּקְדֻשָּׁתְךָ כִי גָּבְרָה\n\nבְּמַיִם חַמִּין צָרִיךְ שֶׁתַּרְחִיץ וְאָז תָּאִיר נִשְׁמָתְךָ הַיְּקָרָה\n\nיֵשׁ כֹּחַ לְךָ בְּזֶה לְגָרֵשׁ הַקְּלִפּוֹת לְעֻמְקָא דְּבֵירָא\n\nמִצְוָה רַבָּה יַקִּירָא שֶׁתַּלְבִּישׁ כְּסוּת נְקִיָּה אַרְבַּע סְדוּרָה\n\nסוֹדָם עָמֹק וְנִסְתָּר בַּקֹּדֶשׁ רְמוּזִים לְאוֹתִיּוֹת הַנּוֹרָא\n\n\nעוֹד יֵשׁ לְךָ לְזֹהַר לְפַשְׁפֵּשׁ אַחַר שֶׁמֶן זַיִת זַךְ לְאוֹרָה\n\nאֶת שְׁתֵּי הַנֵּרוֹת תַּדְלִיק בְּמֶרֶץ לְצַד הַדָּרוֹם הוּא סוֹד מְנוֹרָה\n\nבִּתְפִלּוֹת אַרְבַּע מָתְנֶיךָ שַׁנֵּס תִּתְפַּלֵּל בְכַוָנָה גְּמוּרָה\n\nיְהִי שָׁלוֹם בְּחֵילֵךְ וְתָשִׂישׂ בְּקִיּוּם הַסְעֻדּוֹת בְּמוֹרָא\n\nחֲתֹם פִּיךָ הִשָּׁמֵר לְאֵין קֵץ מִדִּבְרֵי חֹל כִּי נֶחֱשַׁב לְזָרָא\n\n\nצָרִיךְ בְּנִי גַּם בְּזֶה תִּתְאַמֵּץ הִתְרַחֵק מִכָּל מִינֵי הִרְהוּרָא\n\nיְהִי לְמוּדְךָ בְּיוֹם זֶה בְּפַרְדֵּס מִשְׁנֶה עַל אֲשֶׁר לוֹמֵד בִּתְדִירָא\n\nרוּץ נָא מַהֵר פֶּן תֵּעָנֵשׁ הִתְלַמֵּד מִפִּי סוֹפְרִים וְסִפְרָא\n\nאֶת הִלְכוֹת שַׁבָּת הֵם ט''ל תְּבַקֵּשׁ אַךְ בְּתוֹלְדוֹתֵיהֶן לְךָ לְחֻמְרָא\n\nחַזֵּק עַצְמְךָ עֲמֹד בַּפֶּרֶץ אָז תִּזְכֶּה לְנַחֲלָה גְּמוּרָה\n\nזֵכֶר בְּנֵי עֵת סִינַי בַּקֹּדֶשׁ זָכוֹר וְשָׁמוֹר בְּחַד אֲמִירָא\n\nקָדֵשׁ נִשְׁמָתְךָ כְּעִיר וְקַדִּישׁ לְבַר אֱלָהִין תִּדְמֶה בְּיָשְׁרָה\n\nאַל חַי לָנֶצַח עָלֵינוּ פּוֹרֵשׁ סֻכַּת שְׁלֹמֹה זַכָּה וּבָרָה\n\n\nמִמְּעוֹן קָדְשׁוֹ יַבִּיט וְיָצִיץ קֵץ יָמֵינוּ יְגַלֶּה בִּמְהֵרָה\n\nיִשְׁלַח מְשִׁיחֵנוּ הוּא בֶּן פֶּרֶץ אָז שִׁירָה חֲדָשָׁה אֲזַמֵּרָה\n\nצִיּוֹן הִיא עִיר קָדְשֵׁנוּ יְחַדֵּשׁ כְּעִיר אֲשֶׁר יַחְדָּיו לָהּ חֻבְּרָה",
            name: "אפתח פי בדיני שבת",
            double: true
        }
    ],
    rabbiMeir: ["רבי מאיר אביחצירא",
        {
            text: "יחיד רם יְעָרוֹת חוֹשֵׂף לוֹבֵשׁ עוֹז הָדָר וּבַקֹּדֶשׁ נֶאְדָּר שְׁבִי יִשְׂרָאֵל יְאַסֵּף לְעִיר הֶהָדָר\n\nמְרוֹמָם שׁוֹכֵן שְׁחָקִים שְׁכִינְתָא מֵעַפְרָא יָקִים מִצָּרָיו נָקֹם יִנָּקֵם אֱדוֹם וְקֵדָר מֵהֶם טוֹב נֶעְדָּר יִהְיֶה פוֹרֵר לַחֲלָקִים יָתְהוֹן יְבַדַּר\n\nאֵל גָּדוֹל מוֹשִׁיעַ חוֹסִים קֵץ וְצָבָא לַחֹשֶׁךְ תָּשִׂים עַד אָנָה בָּנִים לְחוּצִים בְּשָׂרָם נִקְדָּר וּמְאוֹרָם קָדַר מֶלֶךְ עָלֵינוּ שׂוֹם תָּשִׂים מַלְכָּא לָן שַׁדַּר\n\nיָסַד אֶרֶץ עַל בְּלִימָה גָּרֵשׁ נָא אֶת בֶּן הָאָמָה דֶּגֶל יִשְׂרָאֵל הָרִימָה דֵּין אִיהוּ הָדָר יָפֶה מְהֻדָּר יִתְגַּדֵּל שִׁמְךָ בְעָלְמָא יִתְעַלֶּה יִתְהַדָּר\n\nרֹעֵה יִשְׂרָאֵל הַבִּיטָה בָּעֳנִי בֵּן יָדוֹ מָטָה וְאַף עַל פִּי אֲשֶׁר חָטָא וּבְקִרְבּוֹ הוּא דָּר כָּל קוֹץ וְדַרְדַּר כַּמָּה גְדוֹלָה חֲרָטָה חָזַר בּוֹ הָדַר\n\nרַחוּם מוֹחֵל וְסוֹלֵחַ לְצָרַת הַבַּת תַּשְׁגִּיחַ שָׁרָשֶׁיהָ צִיץ תַּפְרִיחַ גֶּפֶן סְמָדַר בְּאִילָנוֹ דָר מְהֵרָה יִתֵּן הָרֵיחַ כִּפְרִי עֵץ הָדָר\n\nחַי זַךְ קַיָּם בְּחֶמְלָתוֹ יִזְכֹּר לְעוֹלָם בְּרִיתוֹ וְיַתִּיר אֶת שְׁבוּעָתוֹ וַאֲשֶׁר נָדַר וּבְפֶרֶק הַדָּר בַּבַּיִת בְּהִבָּנֹתוֹ סֹחֶרֶת וָדַר",
            name: "יחיד רם יערות חושף",
            double: true
        }
    ]
}
const byTime = {
    rabbiShimon: ["רבי שמעון בר יוחאי",
        {
            text: "אָשִׁיר לִכְבוֹד חֲבֵרִים, וּבְרֹאשָׁם מַלְכָּם אָרִים\nבַּר יוֹחַאי עוֹקֵר הָרִים וְדוֹרֵשׁ טוֹב לְעַמּוֹ\n\nנֶחְתַּם בְּכֶתֶר תּוֹרָה, כְּלוּלִים בּוֹ עֲשָׂרָה\nרְאוּ נָא בָּעֲטָרָה שֶׁעִטְּרָה לּוֹ אִמּוֹ\n\nכַּבִּיר בָּנוּ אַחֲרָיו, ר' אֶלְעָזָר אַשְׁרָיו\nנִכְנַס בָּא בַּחֲדָרָיו שֶׁל הַמֶּלֶךְ שְׁלֵמָה\n\nיקיר עִם זְכוּת אָבוֹת, הִשִּׂיג מַעֲלוֹת רַבּוֹת\nנִגְלוֹ לוֹ ל''ב נְתִיבוֹת בָּהֶם רַבִּים יֶחְכָּמוּ\n\nידיד בְּעָז הִתְאַזָּר, רַב רַבִּי אַבָּא חָזַר\nהוּא וְרַבִּי אֶלְעָזָר אֲחוּזִים בְּיָ''הּ שְׁמוֹ\n\nעֲלֵה לְעִיר גִּבּוֹרִים, בָּהּ חֲמִישִׁים שְׁעָרִים\nמִשָּׁם יוֹצְאִים נְהָרִים וַיִּתְהַלְּכוּ לְעַמּוֹ\n\nקַו חֶסֶד קְנֵה, רַבִּי יְהוּדָה חָנָה\nוְהָעוֹלָם בּוֹ בָּנָה עֹשֶׂה שָׁלוֹם בִּמְרוֹמוֹ\n\nבְּזֶה הוּא רֹאשׁ קְדוֹשָׁה, רַק לֹא בָּא אֵל שְׁלוֹשָׁה\nאַךְ נִכְבַּד מִן הַשִּׁשָּׁה הָיְתָה מִשְׂרָה עַל שֶׁכְּמוֹ\n\nאִישׁ גִּבּוֹר בְּסוֹד תּוֹרָה רַבִּי יִצְחָק הֶאָרָה מִדָּתוֹ\nהִיא גְּבוּרָה צַפִּיחִית מְדַבשׁ טַעֲמוֹ\n\nבְּפִיהוּ אֱמֶת נִכְתַּם רַבִּי יוֹסֵי בַּר יַעֲקֹב תָּם\nעֵץ הַחַיִּים בּוֹ נֶחְתַּם הִיא תִּפְאֶרֶת עֻזָּמוֹ\n\nיָשָׁר רַבֵּי חִזְקִיָּה בְּנֶצַח נַפְשׁוֹ חַיָּה גַּם הוֹד בּוֹ\nכָּלוּל נִהְיֶה הַמְשֵׁל וּפַחַד עַמּוֹ\n\nחָבְרוּ רַבִּי יִסָּא הוֹד וְהָדָר בּוֹ נִמְצָא מִדָּה טוֹבָה\nבָּהּ יִשָּׂא לְרֹאשׁ סַכְתְּ שְׁלוֹמוֹ\n\nצְבָאוֹת בָּהּ נִצְמָדִים שְׁנֵיהֶם יַחַד דּוֹדִים הֵם וּוַי\nהָעַמּוּדִים יָשָׁר יֶחֱזוּ פָּנֵימוֹ\n\nיְסוֹד בְּרַבִּי חַיָּא כָּאן נִמְצָא וְכָאן הָיָה מִשָּׁם\nיוֹצְאָהּ תּוּשִׁיָּה אִמְרוֹתָיו כִּי נָעֲמוּ\n\nרַבִּי יוֹסִי לוֹ זְכוּת הוּא זָכָה אֶל הַמַּלְכוּת כָּל\nתֵּשַׁע הֵם מַלְכוּת שֵׁם כְּבוֹד מִמְּקוֹמוֹ\n\nאַשְׁרֵהוּ לְבַר יוֹחַאי, שֶׁהוּא עַד עֵת בּוֹ מְשִׁיחִי\nקַיֵּם הוּא נֶפֶשׁ כָּל חַי הֵמָּה יֹאכְלוּ בְּלַחְמוֹ\n\nחִזְּקוֹ עֵדָה כְּלוֹלְלָה, הַרְבּוּ שִׂמְחָה וְגִילָה\nבְּיוֹם זֶה יוֹם הִלּוּלָא דּוֹדִים לְכוּ לָחֲמוּ",
            name: "אשיר לכבוד חברים",
            author: "רבי יעקב אביחצירא",
            double: false
        },
        {
            text: "בַּר יוֹחַאי ה' עִמְּךָ, רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ. בַּר יוֹחַאי:\n\nכֶּתֶר עֶלְיוֹן בָּרָאשׁ נִכְתַּרְתָּ, אָמוֹן מֻפְלָא מֻצְנָע גִּלִּיתָ, מְאֹד נַעֲלֵיתָ, אַשְׁרֵי יוֹלַדְתֶּךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nחָכְמָה תָּעֹז תָּרוּם יְמִינֶךָ, בָּרוּךְ אַתָּה בַּפְּרִי בִּטְנֶךָ, רַבִּי אֶלְעָזָר בְּנֶךָ, כָּמוֹךָ הֵן נְטַעְתִּיךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nבִּינָה סוֹד עוֹלָם הַבָּא שָׁמָּה, רַבִּי אַבָּא יָדַע מְקוֹמָהּ, צִיְּרָהּ רְקָמָהּ, בְּצֶדֶק אֶחֱזֶה פָּנֶיךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nחֶסֶד ה' לְבַיֵּשׁ מִדָּה, עַלְּ קַו יְמִינְךָ רַבִּי יְהוּדָה, מַרְגָּלִית חֲמוּדָה, לְהַגִּיד בַּבֹּקֶר חַסְדֶּךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nגְּבוּרָה נִתְגַּבֵּר כַּאֲרִי, רַבִּי יִצְחָק עֵץ עֹשֵׂה פֶּרִי, כִּבְצַלְאֵל בֶּן אוּרִי, לְכָל יָבֹא גְּבוּרוֹתֶיךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nתִּפְאֶרֶת אָדָם מַרְאֵהוּ, רַבִּי יוֹסֵי בַּר יַעֲקֹב הוּא, נוֹעֵץ וַיַּבֵּנֵהוּ, סוֹדֶ תּוֹרַת ה' בְּפִיךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nנֶצַח עָנָף אִישׁ חָסִיד הָיָה, הוּא אֶחָד מִבְּנֵי עֲלִיָּה, הוּא רַבִּי חִזְקִיָּה, שֹׂבַע שְׂמָחוֹת אֶת פָּנֶיךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nהוֹד מֻצָּל נֶאֱצָל וְזָרַח, רַבִּי יֵיסָא לַחֲבֵרָה אָרַח, שׂוֹשׂ יָשִׂישׂ וּפָרַח, פְּתַח לְבָנוֹן דְּלָתַיִךָּ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nדַּלּוֹתִי וְלִי יְהוֹשִׁיעַ, בְּחֶסֶד וֶאֱמֶת תּוֹפִיעַ, שֶׁפַע טוֹב תַּשְׁפִּיעַ, כָּעֵת יְבֹרַךְ בֵּית עַבְדְּךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.\n\nחַיֵּי אֲרִיכַי גַּם נָעֱימִי, וּבָנֵי סְמִיכִי וְחַכִּימִי וּמְזוֹנֵי אַלִּיְּמוּ, עֵינָי כָּלוּ לִישׁוּעָתֶךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ \n\nזֹהַר סְתָרֶיךָ גַּלֵּה נָא הַאֲזִינָה, נִפְלָאוֹת אַבִּיטָה אָבִינָה סוֹדוֹת בֶּאֱמוּנָה, אֲשֶׁר צָפַנְתָּ לִירֵאֶיךָ רֹכֵב שָׁמָיִם בְּעֶזְרֶךָ.\n\nקוֹלִי יֶעֱרַב וְצִפְצוּפִי, יְפֵה נוֹף מְשׂוֹשׂ מִכְלַל יֹפִי, לְרָצוֹן אִמְרֵי פִּי, וְהֶגְיוֹן לִבִּי לְפָנֶיךָ. רֹכֵב שָׁמַיִם בְּעֶזְרֶךָ.",
            name: "בר יוחאי ה'... רוכב שמים",
            author: "רבי מסעוד ארוואח",
            double: true
        },
        {
            text: "בַּר יוֹחָאי יְסוֹד עוֹלָם, בּוֹ בָּחַר מֶלֶךְ עוֹלָם, בִּזְכוּתוֹ עוֹמֵד עוֹלָם, עַד בֹּא בֶּן דָּוִד מֶּלֶךְ.\n\nאַשְׁרֵי חֶלְקוֹ וְאַשְׁרֵי כָּל חֲבֵרָיו, אַשְׁרֵי הוֹגֵי אֲמָרָיו, מַעֲדַנֵּי הַמֶּלֶךְ.\nבַּר יוֹחָאי יְסוֹד עוֹלָם, בּוֹ בָּחַר מֶלֶךְ עוֹלָם, בִּזְכוּתוֹ עוֹמֵד עוֹלָם, עַד בֹּא בֶּן דָּוִד מֶּלֶךְ.\n\nנִגְלָה לוֹ סוֹד הַנִטְמָן, אֲשֶׁר נִגְלָה לְהֵימָן, הוּא בְּבֵיתִי נֶאֱמָן, בְּכָל גִּנְזֵי הַמֶּלֶךְ.\n\nיוֹם לִמְעָרָה בָּרָח, מִשָּׁם הָאוֹר לוֹ זָרָח, הֵצִיץ צִיץ וְגַם פָּרָח, וְגִּדְּלוֹ הַמֶּלֶךְ.\n\nיָצַק מַיִם אַשְׁרֵיהוּ, עַל יְדֵי אֵלִיָּהוּ, כָּל סוֹד נִפְלָא הוֹרָהוּ, כִּי כֵן צִוָּה הַמֶּלֶךְ.\n\nעֲבוֹדָה זוֹ תְּפִלָּה, הִיא הָעֹלָה לְמָעְלָה, אֶת סוֹדוֹתֶיהָ גִלָּה, כִּי כֵן יִסַּד הַמֶּלֶךְ.\n\nקְדֻשַּׁת שַׁבָּת קֹדֶשׁ וְסוֹד מוֹעֵד וָחֹדֶשׁ, גִּלָּה וְגַם סוֹד קַדִּישׁ, בְּרָב עָם הַדְרַת מֶלֶךְ.\n\nבְּרָכוֹת בְּסוֹד נִפְלָא, גִּלָּה אוֹתָם וְהִפְלָא, הַכֹּל לְעַטֵּר כַּלָּה, אֶל בֵּית הַמֶּלֶךְ.\n\nאוֹת בְּרִית צִיצִת וְאוֹת, תְּפִלִּין הַנּוֹרָאוֹת, הִוָּה בָּהֶם נִפְלָאוֹת, חֵן בְּעֵינֵי הַמֶּלֶךְ.\n\nבְּסוֹד הַסּוֹפֵר חָתַם, אוֹת בְּרִית טָמוּן נִסְתָּם, הַכֹּל בַּזֹּהַר נֶחְתַּם, בְּטַבַּעַת הַמֶּלֶךְ.\n\nיַחַד כָּל מִצְוֹת תּוֹרָה, גִּלָּה סוֹדָם וְהוֹרָה, הַכֹּל נֶחְתַּם בִּבְרִירָה, בְּחוֹתָם הַמֶּלֶךְ.\n\nחִבַּר כָּל הָעוֹלָמוֹת, וְיִחֵד כָּל הַשֵּׁמוֹת, וְתִקֵּן הַנְּשָׁמוֹת, לָבוֹא אֶל בֵּית הַמֶּלֶךְ.\n\nצֶדֶק וְשָׁלוֹם נָשָׁקוּ, חֶסֶד וֶאֱמֶת דָּבְקוּ עַל יָדוֹ נִתְמַתָּקוּ, וְנָחָה חֲמַת הַמֶּלֶך.\n\nיִחֵד אֶת הַשְּׁכִינָה, קִשְּׁטָהּ וֶהֶכִינָהּ, כָּל מַעֲשָׂיו אֱמוּנָה, טוֹב בְּעֵינֵי הַמֶּלֶךְ.\n\nרְאוּ יוֹם פְּטִירָתוֹ, הוּא נִקְרָא חֲתֻנָּתוֹ, בּוֹ נִכְנַס לְחֻפָּתוֹ, גִּנַּת בִּיתַן הַמֶּלֶךְ.\n\nאֶת קוֹל שִׂמְחָה וְרִנָּה, נִשְׁמַע בִּשְׁמֵי מְעֹנָה, צְאֶינָה גַם רְאֶינָה בְּנוֹת צִיּוֹן הַמֶּלֶךְ.\n\nחֶדְוָה וְשִׂמְחָה רַבָּה, שַׁעֲשׁוּעַ וְאַהֲבָה, עֵת בֹּא לָעוֹלָם הַבָּא, אֶל תּוֹךְ חֲצַר הַמֶּלֶךְ.\n\nזֶה הַיּוֹם לַ\"ג לָעֹמֶר, נְהַלֵּל בּוֹ נְזַמֵּר, עַל קָדוֹשׁ זֶה יֵאָמֵר, שִׁירוּ שִׁיר אֶל הַמֶּלֶךְ.\n\nקוֹלִי יֶעֱרַב לְךָ כְּמוֹ שַׁי לְפָנֶיךָ, קַדֵּשׁ בִּנְךָ בְּכֹרֶךָ, מַהֵר לְמִקְדַּשׁ הַמֶּלֶךְ.\nבַּר יוֹחָאי יְסוֹד עוֹלָם, בּוֹ בָּחַר מֶלֶךְ עוֹלָם, בִּזְכוּתוֹ עוֹמֵד עוֹלָם, עַד בֹּא בֶּן דָּוִד מֶּלֶךְ.",
            name: "בר יוחאי יסוד עולם",
            author: "רבי יעקב אביחצירא",
            double: false
        },
        {
            text: "אֲרוֹמִמְךָ, אוֹדֶה שִׁמְךָ אֶל בַּעֲשׂוֹתְךָ נוֹרָאוֹת צַדִּיקֶיךָ, חֲסִידֶיךָ עוֹשֶׂה עַל יָדָם נִפְלָאוֹת בְּרוּאֶיךָ, יִירָאוּךָ לָהֶם לְמַזְכֶּרֶת וּלְאוֹת רַבִּי שִׁמְעוֹן גִּלָּה אוֹרָה רַבִּי מֵאִיר אוֹר מְנוֹרָה רַבִּי יַעֲקֹב אַבִּיחֲצִירָא קֹדֶשׁ הִלּוּלִים לָהּ'\n\nנִטְעֵי קֹדֶשׁ, הֵן נָטַעְתָּ וְקוֹל הַתּוֹר עֵת הַזָּמִיר ח''י לַחֹדֶשׁ, יוֹם טוֹב שַׂמְתָּ יוֹם הִלּוּלָה לָ''ג בָּעֹמֶר לְבַר יוֹחַאי, הוֹד עִטַּרְתָּ יוֹם לְיוֹם יַבִּיעַ אֹמֶר אַשְׁרֵי הָעָם שֶׁכָּכָה לּוֹ בִּמְקוֹם קַדְּשׁוֹ יְהַלְּלוֹ שָׁם יָלִינוּ, יִתְפַּלְּלוּ וְיֹאמְרוּ יִגְדַּל יְיָ\n\nיָבוֹאוּ שָׁם, עַם יִשְׂרָאֵל, מִכָּל מְדִינָה וּמְדִינָה גָּלִיל עֶלְיוֹן בִּיאַת גּוֹאֵל, שַׁמָּה גִּלּוּי הַשְּׁכִינָה נִשְׁמַת צַדִּיק מֵאֵל שׁוֹאֵל, לְקָרֵב עֵת לְחַנְּנָהּ בִּזְכוּת שִׂמְחַת זוֹ תּוֹרָתוֹ, הַלּוֹמְדִים קְהַל עֲדָתוֹ וּמְגַלִּים רָזֵי תּוֹרָתוֹ, קָדוֹשׁ כְּמַלְאָךְ יְיָ\n\nמֶלֶךְ תָּמִים הוּא הַתַּנָּא, ר' מֵאִיר בַּעַל הַנֵּס פֶּסַח שֵׁנִי, בּוֹ נִתְקָנָה, הִלּוּלָה לְמוֹפֵת וָנֵס זְכוּתוֹ הִיא מָגֵן צִנָּה, נִדְחֵי יִשְׂרָאֵל יְכַנֵּס נָא יְיָ הוֹשִׁיעָה נָא יְיָ הַצְלִיחָה נָא נָא יְיָ הַרְוִיחָהּ, נָא חִישׁ וְיוֹשַׁע יְיָ\n\nסַגְ'לַמַּסָּא עִיר תְּמָרִים פָּרַח בָּהּ צַדִּיק כַּתָּמָר דֶּגֶל תּוֹרָה הֵקִים הֵרִים שָׁט בַּפַּרְדֵּס כְּמִין חֻמַּר הוֹצִיא לָאוֹר זִו סְתָרִים כָּל דָּבָר וְכָל מַאֲמָר יִרְאָה תַּמָּה הִלְבִּישַׁתּוּ וַעֲנָוָה עִטְּרָתוֹ בַּמְּדִינוֹת שְׁמוּעָתוֹ דַּעַת וְיִרְאַת יְיָ\n\nעָלָה לִשְׁכֹּן בְּאַרְצֵנוּ לִשְׁאֹב מֵימֵי הַטָּהֳרָה יָשִׁיב פִּקָּדוֹן יוֹצְרוֹ קוֹנוֹ בְּתוֹךְ אֶרֶץ הַטְּהוֹרָה חַי וְקַיָּם אֵל בִּרְצוֹנוֹ הִתְקִין מְקוֹם הַקְּבֻרָהּ בְּדַמַּנְהוּר הִיא אֶרֶץ גֹּשֶׁן עִיר שְׁבָטִים הַמְיֻחָסִים שָׁמָּה יֹשֵׁב שָׁמָּה יָשֵׁן בִּמְקוֹם בּוֹ בָּחַר יְיָ\n\nוְאִישׁ מֹשֶׁה בֶּן שֲׁרוֹשִׁי בָּנָה הֵיכָל וּבוֹ קֻבָּה וְגַם נָדַר לִהְיוֹת עֹשֵׂה הִלּוּלָה לִכְבוֹד שַׂר צָבָא בִּרְצוֹן הָאֵל צוּר קְדֹשִׁי גָּזַר אֹמֶר לִהְיוֹת חוֹבָה חֹדֶשׁ טֵבֵת בְּיוֹם עֶשְׂרִים בָּאִים סְבִיבוֹת הֶעָרִים וְעוֹשִׂים סְעֻדּוֹת יְקָרִים בְּחַצְרוֹת בֵּית יְיָ\n\nדּוֹדִים רֵעִים שְׁתוּ שִׁכְרוּ בְּהִלּוּלִים שְׁלֹשָׁה זֶה שמ''י לְעוֹלָם שִׁמְרוּ לְשָׁם הָאֵל רָם וְנִשָּׂא אָז יִקְרַב קֵץ גְּאֻלָּה לִהְיוֹת לוֹ לְעַם סְגֻלָּה וְלִהְיוֹת לוֹ לְנַחֲלָה בְּתוֹךְ מְקַדֵּשׁ יְיָ",
            name: "ארוממיך אודה שמך",
            author: "רבי מסעוד אביחצירא",
            double: false
        },
        {
            text: "בַּר יוֹחַאי נִמְשַׁחְתָּ אַשְׁרֶיךָ שֶׁמֶן שָׂשׂוֹן מֵחֲבֵרֶיךָ\n\nבַּר יוֹחַאי שֶׁמֶן מִשְׁחַת קֹדֶשׁ נִמְשַׁחְתָּ מִמִּדַּת הַקֹּדֶשׁ\nנָשָׂאתָ צִיץ נֵזֶר הַקֹּדֶשׁ חָבוּשׁ עַל רֹאשְׁךָ פְּאֵרֶךָ\n\nבַּר יוֹחַאי מוֹשַׁב טוֹב יָשַׁבְתָּ יוֹם נַסְתָּ יוֹם אֲשֶׁר בָּרַחְתָּ\nבִּמְעָרַת צוּרִים שֶׁעָמַדְתָּ שָׁם קָנִיתָ הוֹדְךָ וַהֲדָרֶךָ\n\nבַּר יוֹחַאי עֲצֵי שִׁטִּים עוֹמְדִים לִמּוּדֵי יְיָ הֵם לוֹמְדִים\nאוֹר מֻפְלֶא אוֹר הַיְקוֹד הֵם יוֹקְדִים הֲלֹא הֵמָּה יוֹרוּךָ מוֹרֶיךָ\n\nבַּר יוֹחַאי וְלִשְׂדֵה תַפּוּחִים עָלִיתָ לִלְקוֹט בּוֹ מֶרְקָחִים\nסוֹד תּוֹרָה כְּצִיצִים וּפְרָחִים נַעֲשֶׂה אָדָם נֶאֱמַר בַּעֲבוּרֶךָ\n\nבַּר יוֹחַאי נֶאֱזַרְתָּ בִּגְבוּרָה וּבְמִלְחֶמֶת אֵשׁ דַּת הַשַּׁעְרָה\nוְחֶרֶב הוֹצֵאתָ מִתַּעְרָהּ שָׁלַפְתָּ נֶגֶד צוֹרְרֶיךָ\n\nבַּר יוֹחַאי לִמְקוֹם אַבְנֵי שַׁיִשׁ הִגַּעְתָּ לִפְנֵי אַרְיֵה לַיִשׁ\nגַּם גֻּלַּת כּוֹתֶרֶת עַל עַיִשׁ תָּשׁוּרִי וּמִי יְשׁוּרֶךָ\n\nבַּר יוֹחַאי בְּקֹדֶשׁ הַקֳּדָשִׁים קַו יָרוֹק מְחַדֵּשׁ חֳדָשִׁים\nשֶׁבַע שַׁבָּתוֹת סוֹד חֲמִשִּׁים קָשַׁרְתָּ קִשְׁרֵי שִׁי''ן קְשָׁרֶיךָ\n\nבַּר יוֹחַאי יוּ''ד חָכְמָה קְדוּמָה הִשְׁקַפְתָּ לִכְבוֹדוֹ פְּנִימָה\nלֵב (שְׁלשִׁים וּשְׁתַּיִם) נְתִיבוֹת רֵאשִׁית תְּרוּמָה אַתְּ כְּרוּב מִמְשַׁח זִיו אוֹרֶךָ\n\nבַּר יוֹחַאי אוֹר מֻפְלֶא רוּם מַעְלָה יָרֵאתָ מִלְּהַבִּיט כִּי רַב לָהּ\nתַּעֲלוּמָה וְאַיִן קוֹרָא לָהּ נַמְתָּ עַיִן לֹא תְשׁוּרֶךָ\n\nבַּר יוֹחַאי אַשְׁרֵי יוֹלַדְתֶּךָ אַשְׁרֵי הָעָם הֵם לוֹמְדֶךָ\nוְאַשְׁרֵי הָעוֹמְדִים עַל סוֹדֶךָ לְבוּשֵׁי חֹשֶׁן תֻּמֶּיךָ וְאוּרֶיךָ",
            name: "בר יוחאי נמשחת אשריך",
            author: "רבי שמעון לביא",
            double: true
        },
        {
            text: "וַאֲמַרְתֶּם כֹּה לֶחָי רַבִּי שִׁמְעוֹן בַּר יוֹחַאי:\n\nאִישׁ אֱלֹהִים קָדוֹשׁ הוּא, אַשְׁרֵי עַיִן רָאַתְהוּ\nלֵב חָכָם יַשְׂכִּיל פִּיהוּ, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nבָּרוּךְ הוּא מִפִּי עֶלְיוֹן, קָדוֹשׁ הוּא מֵהֵרָיוֹן,\nמְאוֹר גָּלִיל הָעֶלְיוֹן, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nגִּבּוֹר וְאִישׁ מִלְחָמָה, בְּדַת תּוֹרָה תְּמִימָה,\nמָלֵא מַדָּע וְחָכְמָה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nדָּרַשׁ כָּל תַּעֲלוּמוֹת בְּעֹז וְתַעֲצוּמוֹת,\nעָלָה מַעֲלוֹת רָמוֹת, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nהֻחְבָּא בְּתוֹךְ מְעָרָה מִפְּנֵי הַגְּזֵרָה,\nשָׁם לָמַד סִתְרֵי תוֹרָה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nוְשָׁם נִבְרָא מַעְיָן לוֹ וְחָרוּב לְמַאֲכָלוֹ,\nמַה טוֹב חֶלְקוֹ וְחֶבְלוֹ, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nזֵכֶר צַדִּיק לִבְרָכָה, דִּין רֵיכָא וּבַר רֵיכָא,\nזָכָה וְרַבִּים זִכָּה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nחִדֵּשׁ כַּמָּה הֲלָכוֹת, הֵן בְּמִשְׁנָה עֲרוּכוֹת,\nזֶה הַמַּרְגִּיז מַמְלָכוֹת, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nטִהֵר אֶת עִיר טְבֶרְיָה, עָשָׂה אוֹתָהּ נְקִיָּה,\nהוֹדוּ לוֹ מִן שְׁמַיָּא, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nיָדַע כָּל הַנִּסְתָּרוֹת, דְּבָרָיו עוֹשִׂים פֵּרוֹת,\nבִּטֵּל כַּמָּה גְּזֵרוֹת, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nכָּל יָמָיו אֲשֶׁר חָיָה, אוֹת הַקֶּשֶׁת לֹא נִהְיָה,\nכִּי הוּא אוֹת עוֹלָם הָיָה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nלְכָל יִשְׂרָאֵל הֵאִיר בְּסוֹד תּוֹרָה הַבָּהִיר,\nכְּאוֹר הַחַמָּה מַזְהִיר, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nמָקוֹם בָּחַר בִּשְׁמַיָּא, עִם הַנָּבִיא אֲחִיָּה,\nזֶה מִבְּנֵי עֲלִיָּה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nנֶחְמָד מְאֹד לְמַעְלָה, זָכָה לִיקָר וּגְדֻלָּה,\nכֶּתֶר עֶלְיוֹן לוֹ נִגְלָה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nסִינַי סִינַי לוֹ נִקְרָא, אֲרִי שֶׁבַּחֲבוּרָה,\nמִמֶּנּוּ תֵּצֵא תּוֹרָה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nעָשָׂה שִׁבְעִים תִּקּוּנִים, יְקָרִים מִפְּנִינִים,\nבָּם תִּקֵּן הָעֶלְיוֹנִים, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nפָּתַח פִּיהוּ בְּחָכְמָה, הוֹצִיא אוֹר תַּעֲלוּמָה,\nתִּקֵּן זָהֳרֵי חַמָּה, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nצַדִּיק יְסוֹד עוֹלָם, גִּלָּה מִדְרַשׁ הַנֶּעֱלָם,\nיָכוֹל לִפְטוֹר הָעוֹלָם, [סוֹדוֹתָיו זָהָב כֻּלָּם] אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nקוֹלוֹ זִמֵּר עָרִיצִים, וְהִכְרִית אֶת כָּל הַקּוֹצִים,\nוְהִצִּיל הַלְּחוּצִים, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nרָאָה פָנָיו מְאִירִים, בְּשִׁבְתּוֹ עִם חֲבֵרִים,\nעֵת גִּלָּה סוֹד נִסְתָּרִים, אֲדוֹנֵנוּ בַּר יוֹחַאי.\n\nשָׁלוֹם רַב עַל מִשְׁכָּבוֹ מַה טּוֹב חֶלְקוֹ וְטוּבוֹ\nדּוֹבֵר אֱמֶת בִּלְבָבוֹ אֲדוֹנֵנוּ בַּר יוֹחַאי\n\nתּוֹרָתוֹ מָגֵן לָנוּ הִיא מְאִירַת עֵינֵינוּ\nהוּא יַמְלִיץ טוֹב עָלֵינוּ אֲדוֹנֵנוּ בַּר יוֹחַאי",
            name: "ואמרתם כל אחי",
            author: "רבינו יוסף חיים",
            double: true
        }
    ],
    rabbiYaKov: ["רבי יעקב אביחצירא",
        {
            text: "אֲרוֹמִמְךָ, אוֹדֶה שִׁמְךָ אֶל בַּעֲשׂוֹתְךָ נוֹרָאוֹת צַדִּיקֶיךָ, חֲסִידֶיךָ עוֹשֶׂה עַל יָדָם נִפְלָאוֹת בְּרוּאֶיךָ, יִירָאוּךָ לָהֶם לְמַזְכֶּרֶת וּלְאוֹת רַבִּי שִׁמְעוֹן גִּלָּה אוֹרָה רַבִּי מֵאִיר אוֹר מְנוֹרָה רַבִּי יַעֲקֹב אַבִּיחֲצִירָא קֹדֶשׁ הִלּוּלִים לָהּ'\n\nנִטְעֵי קֹדֶשׁ, הֵן נָטַעְתָּ וְקוֹל הַתּוֹר עֵת הַזָּמִיר ח''י לַחֹדֶשׁ, יוֹם טוֹב שַׂמְתָּ יוֹם הִלּוּלָה לָ''ג בָּעֹמֶר לְבַר יוֹחַאי, הוֹד עִטַּרְתָּ יוֹם לְיוֹם יַבִּיעַ אֹמֶר אַשְׁרֵי הָעָם שֶׁכָּכָה לּוֹ בִּמְקוֹם קַדְּשׁוֹ יְהַלְּלוֹ שָׁם יָלִינוּ, יִתְפַּלְּלוּ וְיֹאמְרוּ יִגְדַּל יְיָ\n\nיָבוֹאוּ שָׁם, עַם יִשְׂרָאֵל, מִכָּל מְדִינָה וּמְדִינָה גָּלִיל עֶלְיוֹן בִּיאַת גּוֹאֵל, שַׁמָּה גִּלּוּי הַשְּׁכִינָה נִשְׁמַת צַדִּיק מֵאֵל שׁוֹאֵל, לְקָרֵב עֵת לְחַנְּנָהּ בִּזְכוּת שִׂמְחַת זוֹ תּוֹרָתוֹ, הַלּוֹמְדִים קְהַל עֲדָתוֹ וּמְגַלִּים רָזֵי תּוֹרָתוֹ, קָדוֹשׁ כְּמַלְאָךְ יְיָ\n\nמֶלֶךְ תָּמִים הוּא הַתַּנָּא, ר' מֵאִיר בַּעַל הַנֵּס פֶּסַח שֵׁנִי, בּוֹ נִתְקָנָה, הִלּוּלָה לְמוֹפֵת וָנֵס זְכוּתוֹ הִיא מָגֵן צִנָּה, נִדְחֵי יִשְׂרָאֵל יְכַנֵּס נָא יְיָ הוֹשִׁיעָה נָא יְיָ הַצְלִיחָה נָא נָא יְיָ הַרְוִיחָהּ, נָא חִישׁ וְיוֹשַׁע יְיָ\n\nסַגְ'לַמַּסָּא עִיר תְּמָרִים פָּרַח בָּהּ צַדִּיק כַּתָּמָר דֶּגֶל תּוֹרָה הֵקִים הֵרִים שָׁט בַּפַּרְדֵּס כְּמִין חֻמַּר הוֹצִיא לָאוֹר זִו סְתָרִים כָּל דָּבָר וְכָל מַאֲמָר יִרְאָה תַּמָּה הִלְבִּישַׁתּוּ וַעֲנָוָה עִטְּרָתוֹ בַּמְּדִינוֹת שְׁמוּעָתוֹ דַּעַת וְיִרְאַת יְיָ\n\nעָלָה לִשְׁכֹּן בְּאַרְצֵנוּ לִשְׁאֹב מֵימֵי הַטָּהֳרָה יָשִׁיב פִּקָּדוֹן יוֹצְרוֹ קוֹנוֹ בְּתוֹךְ אֶרֶץ הַטְּהוֹרָה חַי וְקַיָּם אֵל בִּרְצוֹנוֹ הִתְקִין מְקוֹם הַקְּבֻרָהּ בְּדַמַּנְהוּר הִיא אֶרֶץ גֹּשֶׁן עִיר שְׁבָטִים הַמְיֻחָסִים שָׁמָּה יֹשֵׁב שָׁמָּה יָשֵׁן בִּמְקוֹם בּוֹ בָּחַר יְיָ\n\nוְאִישׁ מֹשֶׁה בֶּן שֲׁרוֹשִׁי בָּנָה הֵיכָל וּבוֹ קֻבָּה וְגַם נָדַר לִהְיוֹת עֹשֵׂה הִלּוּלָה לִכְבוֹד שַׂר צָבָא בִּרְצוֹן הָאֵל צוּר קְדֹשִׁי גָּזַר אֹמֶר לִהְיוֹת חוֹבָה חֹדֶשׁ טֵבֵת בְּיוֹם עֶשְׂרִים בָּאִים סְבִיבוֹת הֶעָרִים וְעוֹשִׂים סְעֻדּוֹת יְקָרִים בְּחַצְרוֹת בֵּית יְיָ\n\nדּוֹדִים רֵעִים שְׁתוּ שִׁכְרוּ בְּהִלּוּלִים שְׁלֹשָׁה זֶה שמ''י לְעוֹלָם שִׁמְרוּ לְשָׁם הָאֵל רָם וְנִשָּׂא אָז יִקְרַב קֵץ גְּאֻלָּה לִהְיוֹת לוֹ לְעַם סְגֻלָּה וְלִהְיוֹת לוֹ לְנַחֲלָה בְּתוֹךְ מְקַדֵּשׁ יְיָ",
            name: "ארוממיך אודה שמך",
            author: "רבי מסעוד אביחצירא",
            double: false
        },
        {
            text: "",
            name: "אשירה נא לכבוד מרנא",
            author: "רבי אהרון אביחצירא",
            double: true
        },
        {
            text: "",
            name: "אני בניב שפתי",
            author: "רבי יצחק אביטן",
            double: true
        },
        {
            text: "",
            name: "שפתי בשיר ישאו תהילה",
            author: "פיוט לרבי שלמה חיון",
            double: true
        },
        {
            text: "",
            name: "שופט צדק",
            author: "פיוט לרבי שלמה חיון",
            double: true
        },
        {
            text: "",
            name: "אערוך מהלל ניבי",
            author: "רבי יעקב בן עטר",
            double: true
        }
    ],
    rabbiDavid: ["רבי דוד אביחצירא",
        {
            text: "",
            name: "איש חי עלה שמים",
            author: "סימן: אני מימון",
            double: true
        },
        {
            text: "",
            name: "אשיר שירה וזמרה",
            author: "סימן: אני דוד חזק",
            double: true
        },
        {
            text: "",
            name: "אנא נחכי בסוכראן",
            author: "לכבוד משפחת אביחצירא",
            double: true
        }
    ],
    rabbiIsrael: ["רבי ישראל אביחצירא",
        {
            text: "",
            name: "אפתח פי בשיר מזמור",
            author: "רבי ברוך אביחצירה",
            double: true
        },
        {
            text: "",
            name: "לכבוד ריכא בר ריכא",
            author: "רבי מסעוד שניאור",
            double: true
        }
    ],
    honorOfTora: ["פיוטים לכבוד התורה",
        {
            text: "צַהֲלִי רֹנִּי עֵדָה שְׁלֵמָה בְּיוֹם זֶה תּוֹרָה לַחֻפָּה נִכְנְסָה\nזֹאת הִיא כְּבֵדָה בַּת מֶלֶךְ פְּנִימָה וּמִמִּשְׁבְּצוֹת זָהָב לְבוּשָׁהּ\n\nאָשַׁרְנוּ מָה טוֹב נָעִים גּוֹרָלֵנוּ עַל תּוֹרַת אֱמֶת אֵל חַי נָתַן לָנוּ\nוְחַיֵּי עוֹלָם נָטַע בְּתוֹכֵנוּ זוֹ הִיא בְּרָכָה זוֹ הִיא קְדֻשָּׁה\n\nנוֹדַעַת לָנוּ חִבָּה יְתֵרָה אֲשֶׁר אֵין תִּכְלָה וְקֵץ לִשְׂעוֹרָה\nעַל כְּלִי חֶמְדָּה שֶׁבּוֹ עוֹלָם נִבְרָא נָתַן אֵל לָנוּ לָעַד מוֹרָשָׁה\n\nיִשְׂמַח יִשְׂרָאֵל בְּכִפְלֵי כִּפְלַיִם עַל כִּי לֶקַח טוֹב נָתַן לוֹ לְקַיֵּם\nהַמִּכְתָּב מִכְתַּב אֱלֹהִים חַיִּים אַשְׁרֵי הָעָם שֶׁכָּכָה חֹן מָצָא\n\nיָגֵל הַכּוֹתֵב אֶת סֵפֶר הַתּוֹרָה וְגַם הַקּוֹנֶה יוֹשֵׁב בְּזִמְרָה\nשְׁנֵיהֶם טוֹבִים צְדָקָה שְׁמוּרָה לִפְנֵי נֶאֱמָן אֵל רָם וְנִשָּׂא\n\nעַז תַּעֲצֻמוֹת קְדֻשַּׁת הַסֵּפֶר מִי יוּכַל הֶשֵּׂג מִי יוּכַל לְסַפֵּר\nאִמְרוֹת יְיָ הֵם אִמְרֵי שֶׁפֶר שָׂם רֶמֶז פָּשַׁט וְסוֹד וְדָרְשָׁה\n\nקְדֻשַּׁת תֵּבוֹת רְשׁוּמָה בִּסְפִירוֹת תֹּאַר צוּרָתָם אוֹרוֹת יְקָרוֹת\nהֵמָּה מְלָכִים וּבְרֹאשָׁם עֲטָרוֹת לָזֶה יֵשׁ כֶּתֶר וּלְזֶה שְׁלֹשָׁה\n\nבְּנוֹת צִיּוֹן צְאֶינָה וּרְאֶינָה מֶלֶךְ שְׁלֵמָה בְּיוֹם חֲתָנָהּ\nרָאוּ עֲטָרָה וְחֻפָּה נְכוֹנָה גִּלּוּ בִּרְעָדָה וְשִׂמְחָה וְדִיצָה\n\nחָתָן קְדֻשָּׁה יוֹם זֶה חֻפָּתוֹ בִּשְׂמָחוֹת וְגִיל יוֹבֵל לְטִירָתוֹ\nצָרִיךְ כָּל אָדָם לָצֵאת לִקְרָאתוֹ מִנַּעַר וְעַד זָקֵן מֵאִישׁ וְעַד אִשָּׁה\n\nזֶה הַיּוֹם נָגִיל וְגַם נִשְׂמְחָה בּוֹ הַמֶּלֶךְ יוֹשֵׁב בְּתוֹךְ מְסִבּוֹ\nכָּל רַע אוֹהֵב וְקָרוֹב יָבוֹא אֶל תּוֹךְ הַמִּשְׁתֶּה אֲשֶׁר הַמֶּלֶךְ עָשָׂה\n\nקוֹלֵנוּ שָׁמַע שׁוֹמֵעַ תְּפִלּוֹת הָרָם קַרְנֵנוּ מִתּוֹךְ הַגָּלוּת\nבִּזְכוּת הַתּוֹרָה רַבַּת הַמַּעֲלוֹת אָז נָשִׁיר לְךָ שִׁירָה חֲדָשָׁה",
            name: "צהלי רני",
            author: "רבי יעקב אביחצירא",
            double: false
        },
        {
            text: "",
            name: "שמעו בנים מוסר אב",
            author: "רבי יעקב אביחצירא",
            double: false
        },
        {
            text: "",
            name: "לישראל עם סגולה",
            author: "רבי מסעוד אביחצירא",
            double: false
        },
        {
            text: "",
            name: "אשורר לך שיר",
            author: "רבי יצחק אביחצירא",
            double: false
        },
        {
            text: "",
            name: "ה' אלוקינו",
            author: "רבי דוד אביחצירא",
            double: false
        },
        {
            text: "",
            name: "אמת קנה אל תמכור",
            author: "רבי דוד אביחצירא",
            double: false
        },
        {
            text: "יָפָה וְתַמָּה תּוֹרָה תְּמִימָה הַנְּעִימָה\nמִי יוּכַל לְהַעְמִיק בְּסוֹדֵךְ סוֹד אֱלֹהִים חַיִּים\nאוֹר זִיו זָהֳרֵךְ בּוֹעֵר תּוֹךְ קִרְבִּי\nתָּמִיד יִדְרְשׁוּ אוֹתָךְ רַבִּים חֻקִּים וִּמְצוֹת טוֹבִים\nאֶת כָּל לִבּוֹת מַלְהִיבִים נֶאֱהָבִים וְגַם נִשְׂגָּבִים\nוּכְפַטִּישׁ יְפוֹצֵץ סְלָעִים וְהָרִים\nחֵן דַּדַּיִךְ יַרְווּ בְּכָל עֵת תּוֹרַת אֱמֶת\nמִפִּיךְ אָנוּ חַיִּים מִיֵּין סוֹד אֱלֹהִים חַיִּים\n\nנִתְעַלְּסָה בְגִיל בַּאֲהָבִים\nבְּסוֹד נְקֻדּוֹת עִם הַתֵּבוֹת כְּתָרִים עִם אוֹתִיּוֹת\nפְּתוּחוֹת עִם סְתוּמוֹת נֶעְלָמוֹת סוֹדָם בָּרָמוֹת\nאוֹרוֹת עֶלְיוֹנִים טוֹב מִזָּהָב וּפְנִינִים\nמַעְיָן גַּנִּים בְּשִׁבְעִים פָּנִים כֻּלָּם חוֹנִים\nהֵן אֲנִי עֶבֶד נִרְצָע לָךְ קִנְיָן בְּלֵב שָׁלֵם\n\nיוֹרוּ מִשְׁפָּטַיִךְ הָאֵיתָנִים\nתַּנָּאֵי וְאָמוֹרָאֵי גְּאוֹנֵי וּסְבוֹרָאֵי\nוְרַבָּנָן בַּתְרָאֵי לְחַיֵּי מִדְּבַשׁ יָאֶה\nגְּזֵרוֹת שָׁווֹת וַהֲלָכוֹת פְּסוּקוֹת\nכֻּלָּם מִפִּי גְּבוּרָה זִקּוּקַיִן דְּנוּרָא\nבְּקוֹלוֹת וּבְרָקִים מֵאֲרָקִים וְקוֹל מִשָּׁמַיִם\n\nשְׁמוֹת הַקֹּדֶשׁ בָּךְ נֶעֱלָמִים\nאֲשֶׁר בָּם נִבְרְאוּ עוֹלָמִים בְּצֵרוּפִים נִפְלָאִים\nוְהֵמָּה בַּכְּתוּבִים חֲתוּמִים וְגַם סְתוּמִים\nמְאִירִים וּמַזְהִירִים בְּסוֹד יְשָׁרִים\nכִּי חַיִּים הֵם לְמוֹצְאֵיהֶם וָחַי בָּהֶם\nאֲשֶׁר יַעֲשֶׂה הָאָדָם וָחַי מִזִּיו צוּר עוֹלָמִים\n\nלְכוּ לַחֲמוּ תָמִיד בְּלַחְמִי\nבְּיַ\"ג מִדּוֹת תִּדְרֹשׁ הַתּוֹרָה קַל וָחֹמֶר כַּשּׁוּרָה\nהֶקֵּשׁ וּגְזֵרָה שָׁוָה מְסוּרָה מִפִּי גְּבוּרָה\nכְּלָלִים עִם פְּרָטִים תּוֹצִיא לְאוֹרָה\nמִשָּׁם יוֹצְאִים אַרְבַּע נְהָרוֹת כֻּלָּם אוֹרוֹת\nפְּשָׁטִים עִם רְמָזִים נִדְרָשִׁים וְסוֹדוֹת נֶעֱלָמִים\n\nמַה טוֹב דּוֹדַיִך אֲחוֹתִי כַלָּה\nנֹפֶת צוּף דְּבַשׁ שְׂפָתַיִךְ גַּן נָעוּל דְּלָתַיִךְ\nרֵיחַ טוֹב בְּגָדַיִךְ דּוֹדַיִךְ יְפִי עֵינַיִךְ\nחַמָּה וּלְבָנָה כֻּלָּם עָמְדוּ מֵאוֹרֵךְ\nכִּי אֹרֶךְ יָמִים בִּימִינֵךְ עֹשֶׁר בִּשְׂמֹאלֵךְ\nבָּרוּךְ בּוֹרְאֵךְ בְּיָפְיֵךְ וַהֲדָרֵךְ אֵל חַי הָעוֹלָמִים",
            name: "יפה ותמה",
            author: "רבי שלמה אביטבול",
            double: true
        }
    ],
    shabbat: ["פיוטים לכבוד שבת קודש",
        {
            text: "אֵלִי אַנְוֵהוּ וַאֲרֹמְמֶנְהוּ , בְּיוֹם מְנוּחָה הוּא שַׁבָּת לַיְּיָ:\n\nנְעִימָה בְּחִבַּת, קְרוּיָה רַבַּת, וּשְׁמַרְתֶּם הַשׁ ׁבַּת, קֹדֶשׁ לַיְּיָ:\n\nיוֹדֵעַ סוֹדָהּ , נִזְהָר בִּכְבוֹדָהּ, אֲשֶׁר לוֹ יְעָדָהּ, כִּדְבַר יְיָ:\n\nיָבִין מַעֲלָתָהּ, כִּי הַשּׁוֹמֵר אוֹתָהּ, כְּמוֹ הִלְּכַתָּה, מֵהַר יְיָ:\n\nעָוֹן גִּלּוּלוֹ, וְחֵטְא פָּעֳלוֹ , שָׁרוּי לוֹ מָחוֹל לוֹ, וְכִפֵּר יְיָ:\n\nָ קְרָא וּדְרֹשׁ, מִלַּת שַׁבָּת פְּרֹשׁ, קַח לְךָ שִׁי''ן רֹאשׁ, הַבֵּן עֹז יְיָ:\n\nבָּהּ חֶשְׁבּוֹן כָּפַר, כִּי הַשַּׁבָּת תֶּפֶר, חֵטְא רָשׁוּם בַּסֵּפֶר, לִפְנֵי יְיָ:\n\nבֵּי''ת תַּ''ו נִדְרֶשֶׁת, בַּת מֶלֶךְ מִתְפָּרֶשֶׁת, לָנוּ הִיא נִשֵּׂאת, מֵהַר יְיָ:\n\nנְחַשֵּׁב עוֹד מִלָּה, בְּשַׁבַּת מְעֻלָּה, מָלֵא אֶת כֻּלֹּה, דַּע נְאֻם יְיָ:\n\nאָז תִּמְצָא בַּדֹּק, חֶשְׁבּוֹן בְּדִקְדּוּק, שֻׁתָּף בַּת וְדוֹק, כֹּה אָמַר יְיָ :\n\nבֵּאֲרוּ חֲכָמֵינוּ, הַשּׁוֹמֵר שַׁבַּתֵּנוּ, שֻׁתָּף לֶאֱלֹהֵינוּ, גַּם חֲתַן יְיָ:\n\nיֵשׁ בְּשַׁבָּת שׁוּב, אוֹתִיּוֹת תֵּשֵׁב, כִּי בְּשַׁבָּת תַּחְשֹׁב, תְּשׁוּבָה לַיְּיָ:\n\nָ , חֵלֶף זֶה לְךָ אִם תִּבָּזֶה שַׁבָּת לְבֹשֶׁת נֶהְפְּכָה, וַיְנַגַּע יְיָ:\n\nצֹהַר פָּתוּחַ, שֶׁפַע מָתוּחַ, לְשׁוֹמְרֵי מָנוֹחַ, אֶת יוֹם יְיָ:\n\nיָחֵד בְּנִי הִזָּהֵר, לִכְבוֹד שַׁבָּת מַהֵר, וְאַל תְּהַרְהֵר, אַחֲרֵי יְיָ:\n\nָ , רֵאשִׁית דְּגָנֵךְ תִּירֹשְׁךָ וְיִצְהָרֵךְ מִבְחַר מַעֲדַנֶּיךָ תְּכַבֵּד יְיָ:\n\nָ אוֹר שֶׁמֶן כָּתִית, עַל שֶׁלְּחָנְךָ תַּת, הִתְעַנֵּג כִּי אָז תִּתְעַנַּג עַל יְיָ:\n\nָ  חִישׁ קְרָא בַּתּוֹרָה, בְּיוֹם זֶה בְּטָהֳרָה, לְךָ תִּהְיֶה אוֹרָה, יְבָרֶכְךָ יְיָ:\n\nזֶבֶד טוֹב יִזְבְּדֵךְ,  הַשֵּׁם יִשְׁמְרֵךְ, וְיָאֵר אֵלֶיךָ פָּנָיו יְיָ:\n\nקָיָם חַי לָעַד, מַהֵר לָנוּ סַעַד, רַגְלֵנוּ בַּל תִּמְעַד, מִיִּרְאַת יְיָ:",
            name: "אלי אנוהו",
            author: "רבי יעקב אביחצירא",
            double: false
        },
        {
            text: "מִזְמוֹר שִׁיר לְיוֹם הַשַּׁבָּת אֶעֱנֶה חֶלְקִי גַּם אֲנִי\nלְעוֹרֵר לִבִּי אַהֲבַת צוּר עֲשָׁנִי וַיְכוֹנֲנִי\nוּלְעַבְדּוֹ תָּמִיד בְּחִבַּת רֹב חַסְדּוֹ אֲשֶׁר זִכַּנִי\nלְהַלֵּל בְּפִי וּלְשׁוֹנִי\nסוֹד שַׁבָּת זָכוֹר וְשָׁמוֹר אוֹת בְּרִית בֵּינוֹ וּבֵינִי\n\nסְגֻלַּת שַׁבָּת יְקָרָה מַשְׁפַּעַת בְּיָמִים שִׁשָּׁה\nשָׁלֹשׁ מִשַּׁבַּת שֶׁעָבְרָה וּמִן הַבָּאָה שְׁלֹשָׁה\nצָרִיךְ כָּל אָדָם זְכִירָה לְהַמְשִׁיךְ עָלָיו קְדֻשָּׁה\nכְּדַל כֶּעָשִׁיר כֶּעָנִי  : סוֹד\n\nעֶרֶב הַשַּׁבָּת יוֹם שִׁשִּׁי תִּקְנֶה כָּל צֹרֶךְ שַׁבַּתְּךָ\nתָּכִין בְּעַצְמְךָ תַּעֲשֶׂה וְלֹא עַל יְדֵי זוּלָתְךָ\nאֵל מֶלֶךְ יֹשֵׁב עַל כִּסֵּא אֹרֵחַ הַבָּא לִקְרָאתְךָ\nמָה תֹּאמַר וּמָה תַּעֲנֶה  : סוֹד\n\nוּלְקַדֵּשׁ נֹגַהּ חֵן תִּמְצָא פָּרָשַׁת שָׁבוּעַ תִּקְרָא\nשְׁנַיִם מִקְרָא בִּקְדֻשָּׁה וְאֶחָד תַּרְגּוּם בְּמוֹרָא\nטְבִילַת מִצְוָה לְרָחְצָה תִּטְבֹּל בְּמִקְוֵה טָהֳרָה\nאָז בִּצְדָקָה תְּכוֹנְנִי : סוֹד\n\nדִּין מַיִם חַמִּים תַּדִּיחַ פָּנִים יָדָיִם רַגְלַיִם\nסוֹד שַׁלְהֶבֶת יָהּ תָּשִׂיחַ פָּסוּק הַכָּתוּב לְחַיִּים\nאָז הַקְּלִפּוֹת תַּזְנִיחַ מִקֶּרֶב יְרוּשָׁלַיִם\n מַהֵר תְּכוֹנֵן וְתִבְנֶה  : סוֹד\n\nאַרְבַּע בְּגָדִים לְבָנִים, מִשְּׁנַת חֲסִידִים שְׁנוּיָהּ, \nלִכְבוֹד שַׁבָּת מְזֻמָּנִים, לְשָׁרֵת בִּכְסוּת נְקִיָּה, \nרֶמֶז לְאוֹרוֹת עֶלְיוֹנִים, אַרְבַּע אוֹתִיּוֹת הַוַּיָּ\"ה, \nבִּגְדֵי יֶשַׁע תַּלְבִּישֵׁנִי:  סוֹד\n\nבִּתְפִלַּת מִנְחָה בָּעֶרֶב, מַתְחִיל עִלּוּי הָעוֹלָמוֹת,\nאוֹתִיּוֹת הַשֵּׁם לְקָרֵב, אַחַת בְּאַחַת עִם שֵׁמוֹת, \nהַיּוֹצְאִים מֵהֶם בְּקֶרֶב, מַחְשְׁבוֹתֶיךָ יִהְיוּ נִרְשָׁמוֹת, \nנַפְשִׁי יְשׁוֹבֵב יַנְחֵנִי :  סוֹד\n\nיְצִיאַת שָׂדֶה לְהַקְבִּיל, אֶת פְּנֵי שַׁבָּת מַלְכְּתָא, \nנִיצוֹצוֹת קַיִן וָהֶבֶל, לַעֲלוֹת מִגּוֹ עֲמִיקְתָּא, \nיִמְצְאוּ נַחֲלַת חֵבֶל, נַפְשִׁי נִכְסְפָה גַּם כָּלְתָה,\n תְּשַׁוֵּעַ תֹּאמַר הִנֵּנִי:   סוֹד\n\nחוֹבָה שְׁנֵי נֵרוֹת תַּדְרִים, נֵר מִצְוָה אוֹרָה יְגַלֶּה,\nשְׁנֵי מְאוֹרוֹת מַזְהִירִים, אַדְנוּת פָּשׁוּט וְאֵל מָלֵא,\nשָׁלֹשׁ יִחוּדִים מְאִירִים, מִסְפָּרָם לְנֵר יַעֲלֶה,\n מִלְּוַי שַׁדַּ\"י שָׂם יַחֲנֶה:   סוֹד\n\nצִנּוֹרֵי שֶׁפַע בְּרָכָה, יָרִיקוּ בַּעֲנִית בָּרְכוּ,\nרוּחַ הַקֹּדֶשׁ נִמְשָׁכָה, עַל כָּל־אָדָם לְפִי עֶרְכּוֹ,\nעֶבֶד נֶאֱמָן עַל כָּכָה, הֻפְקַד בְּמַאֲמַר מַלְכּוֹ,\nרוּחַ נְדִיבָה תִּסְמְכֵנִי:   סוֹד\n\nיִתְּפַלֵּל עַרְבִית בְּאֵימָה, בְּקוֹל גָּדוֹל בְּסוֹד נֹעַם,\nבִּרְכוֹת שְׁמַע בִּנְעִימָה, בְּכַוָּנָה וּבְטוּב טַעַם,\nוּפְרֹשׂ תּוֹסֶפֶת נְשָׁמָה, תְּכַוֵּן בְּתוֹךְ קְהַל עַם,\nנִשְׁמַת שַׁדַּי תְּבִינֵנִי:    סוֹד\n\nרוֹמְמוֹת אֵל רָם וְנִשָּׂא, בִּמְקוֹם כְּבוֹדוֹ הַלַּיְלָה,\nלְפָנָיו נָאוָה כְּתִרְצָה, מַלְכוּתוֹ בַּכֹּל מָשָׁלָה,\nעָלְתָה לְמַעְלָה וְלָבְשָׁה, כָּל־כָּ\"ד קִשּׁוּטֵי הַכַּלָּה,\nאֶל חֲדָרָיו הֱבִיאַנִי:     סוֹד\n\nאָז תֹּאמַר עֵדוּת קִדּוּשִׁין, בְּשָׁלֹשׁ וַיְּכֻלּוֹ נוֹסָדָה,\nרִאשׁוֹנָה חֲקַל נֶגֶד שִׁי\"ן, תַּפּוּחִין אַחַר עֲמִידָה,\nחֲקַל תַּפּוּחִין קַדִּישִׁין, נִקְרֵאת בְּקִדּוּשׁ סְעוּדָה,\nלֶחֶם חֻקִּי הַטְרִיפֵנִי:\nסוֹד שַׁבָּת זָכוֹר וְשָׁמוֹר, אוֹת בְּרִית בֵּינוֹוּבֵינִי\n",
            name: "מזמור שיר ליום השבת",
            author: "רבי מסעוד אביחצירא",
            double: false
        },
        {
            text: "יוֹם הַשַׁבָּת טוֹב לְהֹדוֹת לָאֵל נוֹרָא תְהִלּוֹת\nלַמְנַצֵּחַ שִׁיר יְדִידֹת זֶמֶר שִׁיר לַמַּעֲלוֹת\n\nאַחַת מִדַּבְּרֹתֶיךָ זָכוֹר וְשָׁמוֹר בְּתוֹרָתֶךָ\nלְהַגִּיד בַּבֹּקֶר חַסְדֶּךָ אֱמוּנָתְךָ בַּלֵּילוֹת\n\nנֹעַם ה' לַחֲזוֹת בְּעוֹד לַיִל בִּזְרִיזוּת\nלִשְׁמֹר פְּתָחִים וּמְזוּזֹת לְהַלֵּל בְּתוֹךְ מַקְהֵלוֹת\n\nיָשָׁר יֶחֱזוּ פָנֶיךָ חוּט חֶסֶד מָשׁוּךְ עָלֶיךָ\nלַעֲמֹד עַל מִשְׁמַרְתֶּךָ לְכוּ חֲזוּ מִפְעֲלוֹת\n\nמִנִּשְׁמַת תִּזְרַח נַפְשֶׁךָ סְמֹךְ גְּאֻלָּה רוּחֶךָ\nאַיֵּה מְקוֹם נִשְׁמָתֶךָ בָּרוּךְ עֹשֶׂה גְדֹלוֹת\n\nסוֹד זֶה בְלִבְּךָ הַצְפִּינוֹ מַחְשְׁבוֹתֶיךָ יִכֹּנוּ\nאָז יִשְׂמַח מֹשֶׁה רַבֵּנוּ בְּאַהֲבַת כְּלוּלוֹת\n\nעֹנֶג לַשַׁבָּת אָז תִּקְרָא לִכְבוֹד נֶפֶשׁ יְתֵרָה\nגַּם לְהִתְעַנֵּג בַּתּוֹרָה בָּרוּךְ עוֹשֶׂה גְדֹלוֹת\n\nוּבְקִדּוּשָׁא רַבָּא וְשָׁמְרוּ שְׂמֹאל עִם יָמִין נִקְשָׁרוּ\nפָּנִים בְּפָנִים נָהָרוּ קוֹל חֲתָנִים בְּמִצְהָלוֹת\n\nדָּא סְעֻדְתָּא דְעַתִּיקָא קַדִּישָׁא חֶסֶד מְרִיקָה\nמֵחֶבֶל גּוֹג וַעֲלוּקָה שָׁלֹשׁ סְעֻדּוֹת מַצִּילוֹת\n\nאָז תִּתְעַנַּג עַל ה' מָקוֹם גָּבֹהַּ מִלְּפָנַי\nכַּאֲשֶׁר הוֹרוּ נְבוֹנַי טְמוּנוֹת לָהֶם נִגְלוֹת\n\nבְּכָבוֹד תֵּשֵׁב בְּשִׂמְחָה נָסוּ יָגוֹן וַאֲנָחָה\nיוֹם תַּעֲנוּג יוֹם מְנוּחָה קוֹל חֲתָנִים וְקוֹל כַּלּוֹת\n\nיְצַו ה' אִתְּךָ הַבְּרָכָה בַּאֲסָמֶיךָ\nכִּי כָל מוֹצָא שַׁבָּתְךָ בְּהוֹצָאוֹת כְּפוּלוֹת\n\nחֶשְׁבּוֹן שַׁבָּת בְּמִנְיָנָהּ רֵי''ש בִּמְקוֹם בֵּי''ת נְתוּנָה\nת''ר כֶּפֶל אוֹת שי''ן רִאשׁוֹנָה לְהוֹרוֹת הַכְּפִילוּת\n\nצַדִּיק אֹכֵל לִכְבוֹד נַפְשׁוֹ אֵיבָרָיו יִתְקַדְּשׁוּ\nצֶלֶם אֱלֹהִים עַל רֹאשׁוֹ אֲיֻמָּה כַּנִּגְדָּלוֹת\n\nיְבָרֵךְ בִּרְכַּת מְזוֹנוֹ רוּחוֹ וְנִשְׁמָתוֹ יֵהָנוּ\nמֵאוֹר הַבָּהִיר יִזּוֹנוּ עֵינֵי הַשֶּׂכֶל מִסְתַּכְּלוֹת\n\nרְאֵה הִתְבּוֹנֵן אִם תִּשְׁמוֹר הַשַּבָּת כַּדִּין הַגָּמוּר\nיִגְאַל רֹכֵב עַל הַחֲמוֹר אֲסִירִים בִּכְבָלוֹת\n\nאַשְׁרֵי הַמְחַכֶּה בִימֵי חוֹל לִקְדֻשַּׁת שַׁבָּת שֶׁתָּחוּל\nכָּל עָוֹן כָּל פֶּשַׁע לוֹ מָחוּל יְשַׁבֵּר עֹל הַגָּלוּת\n\nחוֹמֵד זִיו קְדֻשַּׁת שַׁבָּת וּמְקַיֵם שְׁמִירַת שַׁבָּת\nיִזְכֶּה לְעוֹלָם כֻּלוֹ שַׁבָּת מַעֲלוֹת אַחַר מַעֲלוֹת",
            name: "יום השבת טוב להודות",
            author: "רבי מסעוד אביחצירא",
            double: false
        },
        {
            text: "",
            name: "אשירה לכבוד יום שבת ",
            author: "רבי אברהם",
            double: true
        },
        {
            text: "",
            name: "יום השביעי",
            author: "רבי יצחק אביחצירא",
            double: false
        },
        {
            text: "",
            name: "אשירה לכבוד שבת",
            author: "רבי דוד אביחצירא",
            double: false
        },
        {
            text: "אֶפְתַּח פִּי בְּדִינֵי שַׁבַּת קֹדֶשׁ גַּם בִּקְדֻשַּׁת נְשָׁמָה יְתֵרָה\n\nנָאֶה לָנוּ לְהַלֵּל לְקַדֵּשׁ הָעוֹטֵר יִשְׂרָאֵל בְּתִפְאָרָה\n\nיָהּ רָם יִתְרוֹמֵם בָּחַר וְקִדֵּשׁ עֲדָתוֹ מִכָּל אֻמָּה נִבְעֲרָה\n\nיוֹם הַשִּׁשִּׁי הַשְׁכֵּם לֵךְ לְשַׁמֵּשׁ צָרְכֵי שַׁבָּת חֶמְדָּה נִבְחֲרָה\n\nשִׂים נָא לִבְּךָ אַל תִּהְיֶה חוֹשֵׁשׁ חָלִילָה עַל כָּל כָּבוֹד וּשְׂרָרָה\n\nרָאָה בְּנִי בַּתַּלְמוּד וְחַפֵּשׂ מַאֲמָר קַדִּישִׁין שִׂים עֲטָרָה\n\nאָז תַּכִּיר מְעוּט עֶרְכְּךָ כִּי קְלִישׁ נֶגֶד רַבָּנָן נֶחֱשָׁב כְּעַפְרָא\n\nלִכְבוֹד עֹנֶג הַשַּׁבָּת לֹא תָחִיס עֵינְךָ עַל הַמָּמוֹן כִּי לֹא תִּירָא\n\nבְּנִי הַבֵּט בְּזֶה וְלֹא תַּרְגִּישׁ הַלֹּא בְּתִשְׁרֵי קִצְבָּה נֶעְדָּרָה\n\nלְכָל דִּינֵי הָעֵרוּב תְּחַפֵּשׂ כְּדֵי שֶׁתִּתְנַנְהֵג בָּם כַּשּׁוּרָה\n\nאֶת צִפָּרְנֶיךָ מַהֵר תְּקַצֵּץ עֶרֶב שַׁבָּת חוֹבָה נֶאֶמְרָה\n\nדַּע לְךָ וְהַבֵּן כִּי דִּינָם בָּאֵשׁ תְּלַהֵט רְשָׁעִים אֵשׁ בּוֹעֵרָה\n\nוְהִזָּהֵר בְּנֵי מְאֹד לְהַכְנִיס הַשַּׁבָּת עוֹד שֶׁמֶשׁ בִּגְבוּרָה\n\nנָכוֹן גַּם יָשָׁר לְךָ לְקַדֵּשׁ אֶת עַצְמְךָ בְּמִקְוֵה טַהֲרָה\n\nאָז תָּבִין אִם אַתָּה בַּעַל נֶפֶשׁ וְתַכִּיר בִּקְדֻשָּׁתְךָ כִי גָּבְרָה\n\nבְּמַיִם חַמִּין צָרִיךְ שֶׁתַּרְחִיץ וְאָז תָּאִיר נִשְׁמָתְךָ הַיְּקָרָה\n\nיֵשׁ כֹּחַ לְךָ בְּזֶה לְגָרֵשׁ הַקְּלִפּוֹת לְעֻמְקָא דְּבֵירָא\n\nמִצְוָה רַבָּה יַקִּירָא שֶׁתַּלְבִּישׁ כְּסוּת נְקִיָּה אַרְבַּע סְדוּרָה\n\nסוֹדָם עָמֹק וְנִסְתָּר בַּקֹּדֶשׁ רְמוּזִים לְאוֹתִיּוֹת הַנּוֹרָא\n\n\nעוֹד יֵשׁ לְךָ לְזֹהַר לְפַשְׁפֵּשׁ אַחַר שֶׁמֶן זַיִת זַךְ לְאוֹרָה\n\nאֶת שְׁתֵּי הַנֵּרוֹת תַּדְלִיק בְּמֶרֶץ לְצַד הַדָּרוֹם הוּא סוֹד מְנוֹרָה\n\nבִּתְפִלּוֹת אַרְבַּע מָתְנֶיךָ שַׁנֵּס תִּתְפַּלֵּל בְכַוָנָה גְּמוּרָה\n\nיְהִי שָׁלוֹם בְּחֵילֵךְ וְתָשִׂישׂ בְּקִיּוּם הַסְעֻדּוֹת בְּמוֹרָא\n\nחֲתֹם פִּיךָ הִשָּׁמֵר לְאֵין קֵץ מִדִּבְרֵי חֹל כִּי נֶחֱשַׁב לְזָרָא\n\n\nצָרִיךְ בְּנִי גַּם בְּזֶה תִּתְאַמֵּץ הִתְרַחֵק מִכָּל מִינֵי הִרְהוּרָא\n\nיְהִי לְמוּדְךָ בְּיוֹם זֶה בְּפַרְדֵּס מִשְׁנֶה עַל אֲשֶׁר לוֹמֵד בִּתְדִירָא\n\nרוּץ נָא מַהֵר פֶּן תֵּעָנֵשׁ הִתְלַמֵּד מִפִּי סוֹפְרִים וְסִפְרָא\n\nאֶת הִלְכוֹת שַׁבָּת הֵם ט''ל תְּבַקֵּשׁ אַךְ בְּתוֹלְדוֹתֵיהֶן לְךָ לְחֻמְרָא\n\nחַזֵּק עַצְמְךָ עֲמֹד בַּפֶּרֶץ אָז תִּזְכֶּה לְנַחֲלָה גְּמוּרָה\n\nזֵכֶר בְּנֵי עֵת סִינַי בַּקֹּדֶשׁ זָכוֹר וְשָׁמוֹר בְּחַד אֲמִירָא\n\nקָדֵשׁ נִשְׁמָתְךָ כְּעִיר וְקַדִּישׁ לְבַר אֱלָהִין תִּדְמֶה בְּיָשְׁרָה\n\nאַל חַי לָנֶצַח עָלֵינוּ פּוֹרֵשׁ סֻכַּת שְׁלֹמֹה זַכָּה וּבָרָה\n\n\nמִמְּעוֹן קָדְשׁוֹ יַבִּיט וְיָצִיץ קֵץ יָמֵינוּ יְגַלֶּה בִּמְהֵרָה\n\nיִשְׁלַח מְשִׁיחֵנוּ הוּא בֶּן פֶּרֶץ אָז שִׁירָה חֲדָשָׁה אֲזַמֵּרָה\n\nצִיּוֹן הִיא עִיר קָדְשֵׁנוּ יְחַדֵּשׁ כְּעִיר אֲשֶׁר יַחְדָּיו לָהּ חֻבְּרָה",
            name: "אפתח פי בדיני שבת",
            author: "רבי ישראל אביחצירא",
            double: false
        }
    ],
    massiah: ["פיוטים לכבוד משיח צדקנו",
        {
            text: "",
            name: "יבוא משיחנו בקרוב",
            author: "רבי יעקב אביחצירא",
            double: false
        },
        {
            text: "",
            name: "משיח בן דוד מלכנו",
            author: "רבי דוד בן אהרון",
            double: true
        },
        {
            text: "",
            name: "",
            author: "",
            double: true
        },
        {
            text: "",
            name: "",
            author: "",
            double: true
        }
    ]
}
export { byAuthor, byTime };
